Repository: Markus-web/BookingPress-Finnish-Translation
Catalog: Pro/bookingpress-appointment-booking-*.po
Languages: fi

source: Active
fi: Aktiivinen

source: Inactive
fi: Pois käytöstä

source: Pending
fi: Odottaa

source: Terminated
fi: Päättynyt

source: Employee
fi: Työntekijä

source: Customer
fi: Asiakas

source: Required by BookingPress - Premium
fi: Tarvitaan BookingPress - Premium

source: It seems that your BookingPress license has expired. To continue receiving the updates and technical support, please renew your license from %s
fi: Näyttää siltä, että BookingPress-lisenssisi on vanhentunut. Saadaksesi jatkossakin päivityksiä ja teknistä tukea, uusi lisenssisi osoitteesta %s

source: here
fi: tässä

source: Scheduled Email Notifications
fi: Ajastetut sähköposti-ilmoitukset

source: It seems that WordPress default cron has been disabled on your website and the following feature(s) will not work properly. Please enable WordPress default cron or set up %s, so that the BookingPress feature(s) works smoothly.
fi: Näyttää siltä, että WordPressin oletusarvoinen cron on poistettu käytöstä verkkosivustollasi, eikä seuraava(t) ominaisuus(t) toimi kunnolla. Ota WordPressin oletus cron käyttöön tai aseta %s, jotta BookingPress-ominaisuus(t) toimii moitteettomasti.

source: external cron
fi: ulkoinen cron

source: Show me later
fi: Näytä minulle myöhemmin

source: Already set external cron
fi: Jo asetettu ulkoinen cron

source: Once Off
fi: Kertaluonteinen

source: Repeat Daily
fi: Toista päivittäin

source: Repeat Weekly
fi: Toista viikoittain

source: Repeat Monthly
fi: Toista kuukausittain

source: Repeat Yearly
fi: Toista vuosittain

source: Repeat Every %1$s Days
fi: Toista joka %1$s päivä

source: Repeat Every %1$s Weeks
fi: Toista joka %1$s viikko

source: Repeat Every %1$s Months
fi: Toista joka %1$s kuukausi

source: Repeat Every %1$s Years
fi: Toista joka %1$s vuosi

source: Repeat Daily for %1$s times
fi: Toista päivittäin %1$s kertaa

source: Repeat Weekly for %1$s times
fi: Toista viikottain %1$s kertaa

source: Repeat Monthy for %1$s times
fi: Toista kuukausittain %1$s kertaa

source: Repeat Yearly for %1$s times
fi: Toista vuosittain %1$s kertaa

source: Repeat Every %1$s Days for %2$s times
fi: Toista %1$s päivän välein %2$s kertaa

source: Repeat Every %1$s Weeks for %2$s times
fi: Toista %1$s viikon välein %2$s kertaa

source: Repeat Every %1$s Months for %2$s times
fi: Toista %1$s kuukauden välein %2$s kertaa

source: Repeat Every %1$s Years for %2$s times
fi: Toista %1$s vuoden välein %2$s kertaa

source: Repeat Daily until %1$s
fi: Toista päivittäin, kunnes %1$s

source: Repeat Weekly until %1$s
fi: Toista viikoittain, kunnes %1$s

source: Repeat Monthly until %1$s
fi: Toista kuukausittain, kunnes %1$s

source: Repeat Yearly until %1$s
fi: Toista vuosittain, kunnes %1$s

source: Repeat Every %1$s Days until %2$s
fi: Toista %1$s päivän välein, kunnes %2$s

source: Repeat Every %1$s Weeks until %2$s
fi: Toista %1$s viikon välein, kunnes %2$s

source: Repeat Monthly %1$s until %2$s
fi: Toista kuukausittain %1$s kunnes %2$s

source: Repeat Yearly %1$s until %2$s
fi: Toista vuosittain %1$s kunnes %2$s

source: BookingPress Pro Plugin Requires to update the BookingPress Cart Plugin to version 2.2 or higher.
fi: BookingPress Pro Plugin vaatii BookingPress Cart Pluginin päivittämistä versioon 2.2 tai uudempaan.

source: BookingPress - Cart Add-on version 1.8
fi: BookingPress - Ostoskorin lisäosa versio 1.8

source: BookingPress - Custom Service Duration Add-on version 1.2
fi: BookingPress - Mukautettu palvelun kesto Lisäosa versio 1.2

source: BookingPress - Invoice Add-on version 1.5
fi: BookingPress - Lasku lisäosa versio 1.5

source: BookingPress - Tax Add-on version 1.2
fi: BookingPress - Vero lisäosa versio 1.2

source: BookingPress - Whatsapp Add-on version 1.3
fi: BookingPress - Whatsapp lisäosa versio 1.3

source: BookingPress - Sms Add-on version 1.4
fi: BookingPress - SMS lisäosa versio 1.4

source: One or more plugins need to be updated to its latest version.
fi: Yksi tai useampi lisäosa tarvitsee päivitystä uusimpaan versioonsa.

source: BookingPress "Bring anyone with you" module is now became "Quantity" module. Please refer the changes at
fi: BookingPress "Tuo ketään mukanasi" -moduuli on nyt "Määrä" -moduuli. Katso muutokset osoitteessa

source: Are you sure you have confirm the changes?
fi: Oletko varma, että olet vahvistanut muutokset?

source: An error occurred, please try again.
fi: Tapahtui virhe, yritä uudelleen.

source: Your license key expired on %s.
fi: Lisenssiavaimesi vanhentui %s.

source: Your license key has been disabled.
fi: Lisenssiavaimesi on poistettu käytöstä.

source: Invalid license.
fi: Virheellinen lisenssiavain.

source: Your license is not active for this URL.
fi: Lisenssiavaimesi ei ole käytössä tälle url-osoitteelle.

source: This appears to be an invalid license key for your selected package.
fi: Tämä näyttää olevan virheellinen lisenssiavain valitsemallesi paketille.

source: Your license key has reached its activation limit.
fi: Lisenssiavaimesi aktivointiraja on saavutettu.

source: Error
fi: Virhe

source: Success
fi: Onnistui

source: License verified successfully
fi: Lisenssi vahvistettu onnistuneesti

source: Wizard skipped successfully
fi: Ohjattu asennus ohitettu onnistuneesti

source: Data saved successfully
fi: Tiedot tallennettu onnistuneesti

source: Off
fi: Poissa

source: Next Day
fi: Seuraava päivä

source: Inherit Fonts
fi: Peri fontit

source: Default Fonts
fi: Oletusfontit

source: Google Fonts
fi: Google Fontit

source: First Name
fi: Etunimi

source: Last Name
fi: Sukunimi

source: Email
fi: Sähköposti

source: Phone Number
fi: Puhelinnumero

source: Service Name
fi: Palvelun nimi

source: Price
fi: Hinta

source: Duration
fi: Kesto

source: Description
fi: Kuvaus

source: Something went wrong..
fi: Jotain meni pieleen...

source: Multiple files not allowed
fi: Useita tiedostoja ei sallita

source: Please upload jpg/png file only
fi: Lataa vain jpg/png-tiedosto

source: Something went wrong
fi: Jokin meni vikaan

source: Text copied sucessfully.
fi: Teksti kopioitu onnistuneesti.

source: Staff Members
fi: Henkilökunta

source: Add-ons
fi: Lisäosat

source: Coupon Management
fi: Kuponkien hallinta

source: Edit Appointment
fi: Muokkaa varausta

source: Delete Appointment
fi: Poista varaus

source: Export Appointment
fi: Vie varaus

source: Edit Customer
fi: Muokkaa asiakasta

source: Delete Customer
fi: Poista asiakas

source: Export Customer
fi: Vie asiakas

source: Delete Payment
fi: Poista maksu

source: Export Payment
fi: Vie maksu

source: Edit Staff member basic details
fi: Muokkaa henkilöstön jäsenen perustietoja

source: Edit Staff member Services
fi: Muokkaa Henkilöstön jäsenen palveluita

source: Edit Staffmember Workhour
fi: Muokkaa henkilökunnan jäsenen työtuntia

source: Edit Staffmember Daysoff
fi: Muokkaa henkilökunnan jäsenen vapaapäiviä

source: Edit Staffmember Working Hours
fi: Muokkaa henkilöstön jäsenen työaikaa

source: Add Staffmember
fi: Lisää henkilökunnan jäsen

source: Delete Staffmember
fi: Poista henkilökunnan jäsen

source: Export Staffmember
fi: Vie henkilökunnan jäsen

source: Edit Staff member Special Days
fi: Muokkaa Henkilöstön jäsenen erityispäiviä

source: Manage Calendar Integration
fi: Hallitse kalenterin integrointia

source: Reports
fi: Raportit

source: License
fi: Lisenssi

source: Calendar
fi: Kalenteri

source: Appointments
fi: Ajanvaraukset

source: Payments
fi: Maksut

source: Customers
fi: Asiakkaat

source: Services
fi: Palvelut

source: Discounts
fi: Kupongit

source: Notifications
fi: Ilmoitukset

source: Customize
fi: Mukauta

source: Settings
fi: Asetukset

source: Growth Plugins
fi: Kasvuun lisäosia

source: TimeSheet
fi: Työaikataulu

source: My Profile
fi: Oma profiili

source: My Services
fi: Palveluni

source: BookingPress Lite plugin is required to activate the BookingPress Premium plugin.
fi: BookingPress Lite -lisäosa tarvitaan BookingPress Premium -lisäosan aktivoimiseksi.

source: Appointment reschedule
fi: Ajanvarauksen siirtäminen

source: Inc. GST
fi: Sis. GST

source: Payment token incorrect or mismatch
fi: Maksutunniste on virheellinen tai eivät täsmää

source: Payment already completed
fi: Maksu on jo suoritettu

source: Payment completed successfully
fi: Maksu suoritettu onnistuneesti

source: The link you are trying to access has expired
fi: Linkki, jota yrität käyttää, on vanhentunut

source: The appointment has been successfully approved
fi: Varaus on hyväksytty onnistuneesti

source: The appointment has been successfully rejected
fi: Varaus on onnistuneesti hylätty

source: The appointment has been approved already
fi: Varauksesi on jo hyväksytty

source: The appointment has been rejected already
fi: Varauksesi on jo hylätty

source: Deposit Paid
fi: Talletus maksettu

source: Make Payment
fi: Suorita maksu

source: Complete Payment
fi: Viimeistele maksu

source: Dear %customer_full_name%,<br>You have successfully scheduled appointment.<br>Thank you for choosing us,<br>%company_name%
fi: Hyvä %customer_full_name%,<br>Olet onnistuneesti varannut ajan.<br>Kiitos, että valitsit meidät,<br>%company_name%

source: Hi<br/>Please complete your payment with following URL: <br/>%complete_payment_url%<br/>Thanks,<br/>%company_name%
fi: Hei<br/>Suorita maksusi seuraavassa URL-osoitteessa: <br/>%complete_payment_url%<br/>Kiitos,<br/>%company_name%

source: Dear %customer_first_name% %customer_last_name%,<br /> Your appointment %booking_id% has been canceled successfully, and the refund is initiated for the same from our end.<br /> You should expect the refund to your original payment method within 3 to 5 working days. <br />Thanks,<br />%company_name%
fi: Hyvä %customer_first_name% %customer_last_name%,<br /> tapaamisesi %booking_id% on peruutettu onnistuneesti, ja hyvitys on aloitettu meidän puoleltamme.<br /> Saat palautuksen alkuperäiselle maksutavallesi 3-5 työpäivän kuluessa. <br />Kiitos,<br />%company_name%

source: Hi administrator,<br>You have one confirmed %service_name% appointment. The appointment is added to your schedule.<br>Thank you,<br>%company_name%
fi: Hei ylläpitäjä,<br>Sinulla on yksi vahvistettu %service_name% tapaaminen. Tapaaminen on lisätty aikatauluusi.<br>Kiitos,<br>%company_name%

source: Hi administrator,<br/>Following payment URL is shared with customer. <br/>%complete_payment_url%<br/>Thank you,<br>%company_name%
fi: Hei ylläpitäjä,<br/>Seuraava maksun URL-osoite on jaettu asiakkaan kanssa. <br/>%complete_payment_url%<br/>Kiitos,<br>%company_name%

source: Dear Administrator,<br /> The appointment %booking_id% has been canceled successfully, and the refund is initiated for the same from our end.<br />Thanks,<br />%company_name%
fi: Hyvä ylläpitäjä,<br /> Ajanvaraus %booking_id% on peruutettu onnistuneesti, ja palautus on aloitettu meidän puoleltamme.<br />Kiitos,<br />%company_name%

source: Dear %customer_full_name%,<br> We would like to remind you that you have booked %service_name% on %appointment_date% at %appointment_time%. We are waiting for you at %company_address%.</br>Thank you for choosing our company,</br>%company_name%
fi: Hyvä %customer_full_name%,<br> Haluamme muistuttaa, että olet varannut %service_name% päivälle %appointment_date% ja %appointment_time% aikaan. Odotamme teitä osoitteessa %company_address%</br>.Kiitos, että valitsitte meidät,</br>%company_name%

source: Dear %customer_full_name%, <br> Thank you for choosing %company_name%. We hope you were satisfied with your %service_name%.<br>Thank you and we look forward to seeing you again soon,<br>%company_name%
fi: Hyvä %customer_full_name%, <br> Kiitos, että valitsit %company_name%. Toivottavasti olitte tyytyväinen %service_name%.<br>Kiitos ja odotamme innolla, että tapaamme pian uudelleen,<br>%company_name%

source: Staff
fi: Henkilökunta

source: Select Staff Member
fi: Valitse henkilökunnan jäsen

source: Select Service Extras
fi: Valitse palvelun lisäpalvelut

source: No. of Person
fi: Henkilöiden lukumäärä

source: Cart Items
fi: Ostoskorin tuotteet

source: My Cart Items
fi: Ostoskorini tuotteet

source: Items
fi: Tuotteet

source: Add Services
fi: Lisää palveluita

source: Cart Total
fi: Ostoskori yhteensä

source: Deposit(Paying Now)
fi: Talletus (maksaminen nyt)

source: Deposit Payment
fi: Talletuksen maksu

source: Remaining Amount
fi: Jäljellä oleva määrä

source: Have a coupon code ?
fi: Onko sinulla kuponkikoodi?

source: Enter your coupon code
fi: Kirjoita kuponkikoodi

source: Apply
fi: Käytä

source: Coupon Applied
fi: Kuponki käytetty

source: Credit Card
fi: Luottokortti

source: Card Details
fi: Kortin tiedot

source: Name on card
fi: Nimi kortissa

source: Card Number
fi: Kortin numero

source: Expire Month
fi: Päättymiskuukausi

source: Expire Year
fi: Päättymisvuosi

source: Slots left
fi: Aikoja jäljellä

source: Cancel
fi: Peruuta

source: Continue
fi: Jatka

source: Subtotal
fi: Välisumma

source: Deposit
fi: Talleta

source: Full Payment
fi: Täysi maksu

source: Persons
fi: Henkilöt

source: Any Staff
fi: Kuka tahansa työntekijä

source: Extras
fi: Lisäpalvelut

source: Please Login
fi: Kirjaudu sisään

source: Username
fi: Käyttäjätunnus

source: Password
fi: Salasana

source: Please enter password
fi: Ole hyvä ja syötä salasana

source: Please enter username
fi: Ole hyvä ja syötä käyttäjätunnus

source: LOGIN
fi: KIRJAUDU

source: Lost Your Password
fi: Salasana unohtunut

source: The Username/ Password you entered is invalid.
fi: Syöttämäsi käyttäjätunnus/salasana on virheellinen.

source: Forgot Password
fi: Salasana unohtunut

source: Submit
fi: Lähetä

source: Username OR Email Address
fi: Käyttäjätunnus TAI sähköpostiosoite

source: Please enter email address
fi: Syötä sähköpostiosoite

source: There is no user registered with that email address/Username.
fi: Tällä sähköpostiosoitteella/käyttäjätunnuksella ei ole rekisteröitynyttä käyttäjää.

source: We have sent you a password reset link, Please check your mail.
fi: Olemme lähettäneet sinulle salasanan palautuslinkin, tarkista sähköpostisi.

source: Enter email address
fi: Anna sähköpostiosoitteesi

source: Sign In
fi: Kirjaudu sisään

source: Enter your email address
fi: Syötä sähköpostiosoitteesi

source: Enter your password
fi: Syötä salasanasi

source: Remember Me
fi: Muista minut

source: Enter Current Password
fi: Syötä nykyinen salasana

source: Enter New Password
fi: Syötä uusi salasana

source: Confirm Password
fi: Vahvista salasana

source: Enter new password
fi: Syötä uusi salasana

source: Enter confirm password
fi: Vahvista salasana

source: Update Password
fi: Päivitä salasana

source: Edit Account
fi: Muokkaa tiliä

source: Change Password
fi: Vaihda salasana

source: Logout
fi: Kirjaudu ulos

source: Update Profile
fi: Päivitä profiili

source: Profile Updated Successfully
fi: Profiili päivitetty onnistuneesti

source: Password Change Successfully
fi: Salasanan vaihto onnistui

source: Something went wrong while updating password
fi: Jotain meni pieleen salasanaa päivitettäessä

source: Please enter old password
fi: Syötä vanha salasana

source: Please enter new password
fi: Syötä uusi salasana

source: Please enter confirm password
fi: Vahvista salasana

source: Reschedule
fi: Muuta varausta

source: Reschedule Appointment
fi: Ajoita varaus uudelleen

source: To reschedule your appointment, select an available date time from the calendar
fi: Jos haluat siirtää varaustasi, valitse kalenterista vapaana oleva aika

source: Date
fi: Päivämäärä

source: Time
fi: Aika

source: Select Time
fi: Valitse aika

source: Update
fi: Päivitä

source: Appointment Rescheduled Successfully
fi: Ajanvaraus muutettu onnistuneesti

source: Delete Your Account
fi: Poista käyttäjätilisi

source: This will delete your all data & appointments from bookingpress
fi: Tämä poistaa kaikki tietosi ja tapaamiset bookingpressistä

source: Delete Account
fi: Poista käyttäjätili

source: Download Invoice
fi: Lataa lasku/kuitti

source: Tax
fi: Vero

source: Coupon
fi: Kupongit

source: Book Again
fi: Varaa uudestaan

source: Paid Amount
fi: Maksettu summa

source: Refund Amount
fi: Hyvityssumma

source: Payment Method
fi: Maksutapa

source: Please select staff member
fi: Valitse henkilökunnan jäsen

source: Coupon code is not valid
fi: Kuponkikoodi ei ole kelvollinen

source: Coupon code not allowed
fi: Kuponkikoodi ei ole sallittu

source: Coupon code expired
fi: Kuponkikoodi on vanhentunut

source: Coupon code is not valid for selected service
fi: Kuponkikoodi ei ole voimassa valittuun palveluun

source: Coupon code no longer available
fi: Kuponkikoodi ei ole enään saatavilla

source: Coupon code does not exist
fi: Kuponkikoodia ei ole olemassa

source: Refund policy message
fi: Palautuskäytäntöä koskeva viesti

source: Please upload maximum 1 MB file only
fi: Lataa enintään 1 Mt:n tiedosto

source: Mins
fi: Minuuttia

source: Days
fi: Päivää

source: Hours
fi: Tuntia

source: Uncategorized
fi: Luokittelematon

source: Sorry, you are not allowed to perform this action.
fi: Valitettavasti et voi suorittaa tätä toimintoa.

source: Sorry. Something went wrong while processing the request
fi: Pahoittelut. Jokin meni pieleen pyynnön käsittelyssä

source: Addon Activated Successfully
fi: Lisäosa aktivoitu onnistuneesti

source: BookingPress WooCommerce payment gateway addon requires WooCommerce plugin installed and active
fi: BookingPress WooCommerce maksuyhdyskäytävä lisäosa vaatii WooCommerce lisäosan asennettuna ja aktiivisena

source: Addon Deactivated Successfully
fi: Lisäosa otettu pois käytöstä onnistuneesti

source: Addons list fetched successfully
fi: Lisäosien luettelo haettu onnistuneesti

source: Warning
fi: Varoitus

source: Please assign at least one staff member to the service otherwise service will not display at the front end.
fi: Määritä palvelulle vähintään yksi henkilökunnan jäsen, muuten palvelu ei näy sivuilla.

source: Sorry module is not deactivated because One or more appointment is already booked with the staff member.
fi: Valitettavasti moduulia ei ole poistettu käytöstä, koska yksi tai useampi tapaaminen on jo varattu henkilökunnan jäsenen kanssa.

source: Module De-Activated successfully
fi: Moduuli otettu pois käytöstä onnistuneesti

source: Module activated successfully
fi: Moduuli aktivoitu onnistuneesti

source: Staff Member
fi: Henkilökunnanjäsen

source: Enable staff option throughout your website
fi: Ota käyttöön henkilökunnan valinta koko verkkosivustollasi

source: Service Extra
fi: Palvelun lisäpalvelut

source: Enable extras for your services
fi: Ota käyttöön lisäpalvelut palveluihisi

source: Give discount coupons while booking an appointment
fi: Anna alennuskuponkeja varauksen yhteydessä

source: Allow partial payments to be charged to a customer while booking an appointment
fi: Mahdollistaa osamaksujen veloittamisen asiakkaalta ajanvarauksen yhteydessä

source: Multiple Quantity
fi: Useimpia varauksia

source: Allow customer to book an appointment for more than one person
fi: Salli asiakkaan varata tapaaminen useammalle kuin yhdelle henkilölle

source: Something went wrong while process with refund
fi: Jokin meni pieleen palautusprosessin aikana

source: Data retrieved successfully
fi: Tiedot haettu onnistuneesti

source: Day
fi: Päivä

source: Custom fields retrieved successfully.
fi: Mukautetut kentät haettu onnistuneesti.

source: Sorry, Appointment can not be rescheduled as the original time has been passed.
fi: Valitettavasti tapaamista ei voida siirtää, koska alkuperäinen aika on jo mennyt umpeen.

source: Sorry, Appointment can not be rescheduled as the selected time has been passed.
fi: Valitettavasti tapaamista ei voida siirtää, koska valittu aika on jo mennyt umpeen.

source: Extra services data retrived successfully
fi: Lisäpalvelutiedot haettu onnistuneesti

source: Bulk Action
fi: Massatoiminto

source: Delete
fi: Poista

source: Change Status
fi: Muuta tilaa

source: Please select
fi: Ole hyvä ja valitse

source: Please select booking end time
fi: Valitse varauksen päättymisaika

source: Please select booking end date
fi: Valitse varauksen päättymispäivä

source: Customer Full Name
fi: Asiakkaan kokonimi

source: Customer Email Address
fi: Asiakkaan sähköpostiosoite

source: Customer Phone number
fi: Asiakkaan puhelinnumero

source: Staff Member Full Name
fi: Henkilöstön jäsenen kokonimi

source: Service
fi: Palvelu

source: Amount
fi: Määrä

source: Start Time
fi: Aloitusaika

source: End Time
fi: Päättymisaika

source: Note
fi: Muistiinpano

source: Appointment Status
fi: Ajanvarauksen tila

source: Created Date
fi: Luotu

source: is required
fi: vaaditaan

source: Minimum
fi: Minimi

source: character required
fi: vaadittu merkki

source: Maximum
fi: Maksimi

source: character allowed
fi: sallittu merkki

source: Please enter firstname
fi: Kirjoita etunimi

source: Please enter lastname
fi: Kirjoita sukunimi

source: Please enter valid email address
fi: Syötä kelvollinen sähköpostiosoite

source: Please select Wordpress User
fi: Valitse Wordpress-käyttäjä

source: Please select staffmember
fi: Valitse henkilökunnan jäsen

source: Appointment status has been change successfully.
fi: Ajanvarauksen tila on muutettu onnistuneesti.

source: Start time is not greater than End time
fi: Aloitusaika ei ole suurempi kuin lopetusaika

source: Start time and End time are not same
fi: Aloitusaika ja lopetusaika eivät ole samat

source: You have selected past time for the appointment, Do you still want to continue?
fi: Olet valinnut tapaamisen ajankohdan menneisyydessä, haluatko vielä jatkaa?

source: Refund amount should be more than zero
fi: Palautuksen määrän olisi oltava suurempi kuin nolla

source: Refund amount should not be more than paid the amount.
fi: Palautuksen määrä ei saisi olla suurempi kuin maksettu määrä.

source: Sorry! Booking can not be done as the selected number of person is malformed.
fi: Anteeksi! Varausta ei voida tehdä, koska valittu henkilömäärä on virheellinen.

source: Guest
fi: Vieras

source: No. of Person title
fi: Henkilöiden lukumäärä (Otsikko)

source: Person title
fi: Henkilön otsikko

source: Person
fi: Henkilö

source: Please select end date.
fi: Valitse päättymispäivä.

source: Please select valid end date.
fi: Valitse voimassa oleva päättymispäivä.

source: Please select date.
fi: Valitse päivämäärä.

source: Please select end date is bigger then start date.
fi: Valitse loppupäivämäärä isompi kuin alkupäivämäärä.

source: You have selected break hours time, Are you sure to add appointment ?
fi: Olet valinnut taukotuntien ajan, Oletko varma, että haluat lisätä varauksen?

source: Coupon applied title
fi: Kuponki sovellettu otsikko

source: Coupon code not applied on this service
fi: Kuponkikoodia ei sovelleta tähän palveluun

source: Sorry, Your request can not be processed due to security reason.
fi: Valitettavasti pyyntöäsi ei voida käsitellä turvallisuussyistä.

source: Coupon applied successfully
fi: Kuponki lisätty onnistuneesti

source: Coupon status change successfully
fi: Kupongin tila muuttui onnistuneesti

source: Coupons deleted successfully
fi: Kupongit poistettu onnistuneesti

source: Coupon deleted successfully
fi: Kuponki poistettu onnistuneesti

source: Coupons fetched successfully
fi: Kupongit haettu onnistuneesti

source: May not add more than a 100% discount.
fi: Ei saa lisätä enempää kuin 100% alennuksen.

source: Coupn Period Start date is not greater than End date
fi: Kupongin alkamispäivä ei ole suurempi kuin päättymispäivä

source: Coupon Code already exists
fi: Kuponkikoodi on jo olemassa

source: Coupon created successfully
fi: Kuponki luotu onnistuneesti

source: Coupon updated successfully
fi: Kuponki päivitetty onnistuneesti

source: Coupon code copied sucessfully.
fi: Kuponkikoodi kopioitu onnistuneesti.

source: Please select any action.
fi: Valitse mikä tahansa toiminto.
