Repository: Markus-web/BookingPress-Finnish-Translation
Catalog: Pro/bookingpress-appointment-booking-*.po
Languages: fi

source: Delete Appointments
fi: Poista ajanvaraukset

source: Export Appointments
fi: Vie ajanvaraukset

source: View Payments
fi: Näytä maksut

source: Edit Payments
fi: Muokkaa maksuja

source: Refund Payments
fi: Palautuksen maksaminen

source: Delete Payments
fi: Poista maksut

source: Export Payments
fi: Vie maksut

source: View Customers
fi: Näytä asiakkaat

source: Delete Customers
fi: Poista asiakkaat

source: Export Customers
fi: Vie asiakkaat

source: Profile
fi: Profiili

source: Manage Working Hours
fi: Hallitse työaikoja

source: Manage Holiday
fi: Hallitse lomia

source: Manage Special Days
fi: Hallitse erityispäiviä

source: Rename Staff Member Module
fi: Henkilöstön jäsenmoduulien uudelleennimeäminen

source: Singular Staff Member Label
fi: Yksittäisen työntekijän etiketti

source: For example, Doctor, Employee etc...
fi: Esimerkiksi lääkäri, työntekijä jne....

source: Plural Staff Member Label
fi: Henkilöstön jäsenen monikossa käyettävä etiketti

source: For example, Doctors, Employees etc...
fi: Esimerkiksi lääkärit, työntekijät jne....

source: Manage
fi: Hallitse

source: FullName
fi: Koko nimi

source: Are you sure you want to deactivate
fi: Haluatko varmasti ottaa pois käytöstä

source: Are you sure you want to activate
fi: Haluatko varmasti aktivoida

source: Are you sure you want to delete this
fi: Haluatko varmasti poistaa tämän

source: Public
fi: Julkinen

source: Private
fi: Yksityinen

source: No Services Available
fi: Ei palveluita saatavilla

source: Integration
fi: Integraatio

source: Assign Service
fi: Määritä palvelu

source: Configure staff specific work hours
fi: Työntekijän henkilökohtaisten työaikojen määrittäminen

source: Applied for all assigned services
fi: Käytössä kaikissa määritetyissä palveluissa

source: Max
fi: Maksimi

source: Extra's
fi: Lisäpalvelut

source: Configure specific workhours
fi: Määritä tietyt työtunnit

source: Are you sure you want to delete this Special days?
fi: Oletko varma, että haluat poistaa nämä erityispäivät?

source: Holiday
fi: Loma(t)

source: Company Holiday
fi: Yrityksen loma

source: Yearly
fi: Vuosittain

source: Are you sure you want to delete holiday?
fi: Oletko varma, että haluat poistaa loman?

source: Number of guests
fi: Vieraiden määrä

source: Choose a file...
fi: Valitse tiedosto...

source: The sppointment has been successfully approved
fi: Varaus on hyväksytty onnistuneesti

source: Your Site
fi: Sinun sivustosi

source: Give some information about your company
fi: Anna tietoja yrityksestäsi

source: Company Name
fi: Yrityksen nimi

source: Enter your company name
fi: Kirjoita yrityksesi nimi

source: Enter your company address
fi: Kirjoita yrityksesi osoite

source: Time Format
fi: Aikamuoto

source: Select Time Format
fi: Valitse aikamuoto

source: Date Format
fi: Päivämäärämuoto

source: Select date format
fi: Valitse päivämäärämuoto

source: Country
fi: Maa

source: Select your country
fi: Valitse maasi

source: Phone No
fi: Puhelinnumero

source: Enter phone no
fi: Syötä puhelinnumero

source: Timezone
fi: Aikavyöhyke

source: Select Timezone
fi: Valitse aikavyöhyke

source: Enter your website url
fi: Kirjoita verkkosivustosi osoite

source: Company Logo
fi: Yrityksen logo

source: Do you have multiple staff?
fi: Onko sinulla useita työntekijöitä?

source: Booking Options
fi: Ajanvarauksen asetukset

source: Help us understand your booking options
fi: Auta meitä ymmärtämään varausvaihtoehtosi

source: Default working hours
fi: Oletustyöajat

source: Select Currency
fi: Valitse valuutta

source: Enable Invoice Option
fi: Ota laskutusvaihtoehto käyttöön

source: Enable Tax Option
fi: Ota verovaihtoehto käyttöön

source: Allow Discount Coupon
fi: Salli alennus kupongit

source: Staff Details
fi: Työntekijän tiedot

source: Please configure some basic options about staff and add your staff here
fi: Määritä joitakin henkilökuntaa koskevia perusasetuksia ja lisää henkilökuntasi tänne

source: Staff Permissions
fi: Henkilöstön oikeudet

source: Allow Edit/Delete their Appointments
fi: Salli omien ajanvarausten muokkaus/poisto

source: Allow customer handling
fi: Salli asiakkaan käsittely

source: Can view payment activities
fi: Voi tarkastella maksutapahtumia

source: Add New Staff
fi: Lisää uusi työntekijä

source: Service Options
fi: Palveluvaihtoehdot

source: Add your services here with basic options or you can add them later too
fi: Lisää palvelusi tässä perusvaihtoehdoilla tai voit lisätä ne myös myöhemmin

source: Styling
fi: Muotoilu

source: Almost there. Choose basic colors & fonts.
fi: Melkein valmis. Valitse vielä perusvärit ja fontit.

source: Font Selection
fi: Fontin valinta

source: Select Font
fi: Valitse fontti

source: Color Options
fi: Värivaihtoehdot

source: Primary
fi: Ensisijainen

source: Sub Title
fi: Alaotsikko

source: Content
fi: Sisältö

source: Prefered Booking Form Sequence
fi: Suositeltava varauslomakkeen järjestys

source: Finish
fi: Viimeistele

source: Ready
fi: Valmis

source: Congratulations!
fi: Onnittelut!

source: Hurray!! Everything is ready to accept your first online booking now
fi: Mahtavaa! Kaikki on nyt valmista ja olet valmis hyväksymään ensimmäisen ajanvarauksenne

source: Your site is ready & below are the details
fi: Sivustosi on valmis ja alapuolella on lisätietoja

source: Useful Links
fi: Hyödyllisiä linkkejä

source: Documentation
fi: Dokumentaatio

source: Get 24x7 Support
fi: Hanki 24x7-tukea

source: Explore Features
fi: Tutustu ominaisuuksiin

source: Close and Exit Wizard Without Saving
fi: Sulje ja poistu ohjatusta toiminnosta tallentamatta

source: Activate Your License
fi: Aktivoi lisenssisi

source: Select Package
fi: Valitse paketti

source: License Key
fi: Lisenssiavain

source: Enter your license key
fi: Syötä lisenssiavaimesi

source: Connect
fi: Yhdistä

source: BookingPress Pro - Appointment Booking plugin
fi: BookingPress Pro - ajanvaraus lisäosa

source: Book appointments, create bookings, and pay online with BookingPress. Easily create appointments, manage time, and send out customized emails.
fi: Varaa tapaamisia, luo varauksia ja maksa verkossa BookingPressin avulla. Luo helposti tapaamisia, hallitse aikoja ja lähetä räätälöityjä sähköposteja.
