Repository: Markus-web/BookingPress-Finnish-Translation
Catalog: Pro/bookingpress-appointment-booking-*.po
Languages: fi

source: Disable Required
fi: Pois käytöstä vaaditaan

source: Enable Required
fi: Käyttöön otto vaaditaan

source: Approved Appointments
fi: Vahvistetut ajanvaraukset

source: Pending Appointments
fi: Odottavat ajanvaraukset

source: Revenue
fi: Tuotto

source: Technical Analysis
fi: Pikakatsaus

source: Upcoming Appointments
fi: Tulevat ajanvaraukset

source: Guests
fi: Vieraat

source: Advance Options
fi: Ennakkovaihtoehdot

source: See Less
fi: Näe vähemmän

source: View More
fi: Näytä lisää

source: View Less
fi: Näytä vähemmän

source: No categories and services added!
fi: Luokkia ja palveluita ei ole lisätty!

source: No Appointments found!
fi: Varauksia ei löytynyt!

source: paid by admin
fi: maksanut admin

source: Cancel Appointment
fi: Peruuta ajanvaraus

source: Prev
fi: Edellinen

source: Next
fi: Seuraava

source: Edit Profile
fi: Muokkaa profiilia

source: Import/Export
fi: Tuo/Vie

source: Import/Export Tool
fi: Tuonti/vientityökalu

source: Select Export Data
fi: Valitse Vietävät tiedot

source: Select ALL
fi: Valitse KAIKKI

source: Stop Export
fi: Lopeta vienti

source: Download File
fi: Lataa tiedosto

source: Import
fi: Tuo

source: Import File Data
fi: Tiedoston tietojen tuonti

source: Copy and paste the exported file content
fi: Kopioi ja liitä viedyn tiedoston sisältö

source: Default Notifications
fi: Oletusilmoitukset

source: Appointment Approval Notification
fi: Ilmoitus varauksen hyväksymisestä

source: On Approval
fi: Hyväksyttäessä

source: Appointment Pending Notification
fi: Vireillä olevan varauksen Ilmoitus

source: On Pending
fi: Vireillä

source: Appointment Rejection Notification
fi: Ilmoitus varauksen hylkäämisestä

source: On Rejection
fi: Hylättäessä

source: On Cancellation
fi: Peruutuksen yhteydessä

source: Appointment Rescheduled Notification
fi: Ilmoitus ajanvarauksen siirtämisestä

source: On Rescheduled
fi: Uudelleen aikataulutettu

source: Share Appointment URL Notification
fi: Ajanvarauksen jaon URL-ilmoitus

source: Share Appointment URL
fi: Jaa varauksen URL-osoite

source: Complete Payment URL Notification
fi: Täydellinen maksu URL-ilmoitus

source: Complete Payment URL
fi: Täydellinen maksun URL-osoite

source: Refund Payment Notification
fi: Ilmoitus palautuksen maksamisesta

source: Refund Payment
fi: Palautuksen maksaminen

source: Custom Notifications
fi: Mukautetut ilmoitukset

source: Edit options
fi: Muokkaa vaihtoehtoja

source: Are you sure you want to delete this Notification?
fi: Haluatko varmasti poistaa tämän ilmoituksen?

source: Send Notification
fi: Lähetä ilmoitus

source: CC Email Address
fi: CC sähköpostiosoite

source: Please enter comma-separated email addresses if you want to send notification to multiple email address
fi: Erota pilkulla jokainen sähköpostiosoite, jos haluat lähettää ilmoituksen useampaan sähköpostiosoitteeseen

source: Enter CC Email Address
fi: Syötä CC-sähköpostiosoite

source: Email Subject
fi: Sähköpostin aihe

source: Enter Subject
fi: Kirjoita aihe

source: Email Message
fi: Sähköpostin viesti

source: Allowed HTML tags <div>, <label>, <span>, <p>, <ul>, <li>, <tr>, <td>, <a>, <br>, <b>, <h1>, <h2>, <hr>
fi: Sallitut HTML-tagit <div>, <label>, <span>, <p>, <ul>, <li>, <tr>, <td>, <a>, <br>, <b>, <h1>, <h2>, <hr>

source: Please add <br /> in the email message to add a new line
fi: Lisää sähköpostiviestiin <br /> lisätäksesi uuden rivin

source: Enter key will not be considered as new line
fi: Enter-näppäintä ei sovelleta uutena rivinä

source: Scheduled emails depends on WordPress' cron mechanism and it may not send notifications on accurate time due to it's limitations. If you want more accurate notifications for reminders, please follow the steps described %s here %s
fi: Ajastetut sähköpostit riippuvat WordPressin cron-mekanismista, eikä se välttämättä lähetä ilmoituksia täsmällisesti ajallaan sen rajoitusten vuoksi. Jos haluat tarkempia ilmoituksia muistutuksia varten, noudata ohjeita, jotka on kuvattu %s täällä %s

source: Attach ICS file with email
fi: Liitä ICS-tiedosto sähköpostiin

source: Insert email placeholders
fi: Lisää sähköpostin leipätekstit

source: Company
fi: Yritys

source: Staf Member
fi: Henkilökunnan jäsen

source: Appointment
fi: Ajanvaraus

source: Edit Notification
fi: Muokkaa ilmoitusta

source: Add Notification
fi: Lisää ilmoitus

source: Notification name
fi: Ilmoituksen nimi

source: Enter notification name
fi: Syötä ilmoituksen nimi

source: Notification type
fi: Ilmoituksen tyyppi

source: Action / Trigger notification
fi: Toiminta / laukaisuilmoitus

source: Scheduled notification
fi: Ajastettu ilmoitus

source: Schedule
fi: Aikataulu

source: Before
fi: Ennen

source: After
fi: Jälkeen

source: Weeks
fi: Viikot

source: Any Service
fi: Mikä tahansa palvelu

source: Appointment status trigger
fi: Ajanvaraustilanteen laukaisu

source: Approved
fi: Hyväksytty

source: Canceled
fi: Peruttu

source: Rejected
fi: Hylätty

source: Manage Payments
fi: Hallitse maksuja

source: Transaction Date
fi: Maksun päivämäärä

source: Mode
fi: Tila

source: Transaction ID
fi: Tapahtuman ID

source: Appointment Details
fi: Ajanvarauksen yksityiskohdat

source: Total Persons
fi: Henkilöitä yhteensä

source: Payment Summary
fi: Maksun yhteenveto

source: Due Amount
fi: Maksettava

source: Refunded Amount
fi: Hyvitetty summa

source: Balance Amount
fi: Saldon määrä

source: Method
fi: Menetelmä

source: Appointment On
fi: Ajanvaraus on

source: Share Payment Link
fi: Jaa maksulinkki

source: Send Link
fi: Lähetä linkki

source: Are you sure you want to approve the Payment (Appointment will automatically be approved)?
fi: Haluatko varmasti hyväksyä maksun (tapahtuma hyväksytään automaattisesti)?

source: Are you sure you want to delete this payment transaction?
fi: Haluatko varmasti poistaa tämän maksutapahtuman?

source: View Details
fi: Näytä tiedot

source: Payment Gateway
fi: Maksuyhdyskäytävä

source: Coupon Text
fi: Kuponkiteksti

source: Coupon Amount
fi: Kupongin arvo

source: Tax Percentage
fi: Veroprosentti

source: Tax Amount
fi: Veron määrä

source: Appointment status
fi: Varauksen tila

source: Manual ( Paid by admin )
fi: Manuaalinen ( adminin maksama )

source: Appointment Report
fi: Ajanvarausraportti

source: Quick Stats
fi: Nopea katsaus

source: Appointments Summary
fi: Ajanvarausten yhteenveto

source: Revenue Report
fi: Tuloraportti

source: Select Payment Gateway
fi: Valitse maksuväylä

source: Revenue Summary
fi: Tulojen yhteenveto

source: Customers Report
fi: Asiakasraportti

source: Customer Summary
fi: Asiakkaan yhteenveto

source: Last Appointment Booked
fi: Viimeisin varattu tapaaminen

source: Manage Services
fi: Hallitse palveluita

source: Manage Categories
fi: Hallitse kategorioita

source: Enter Service Name
fi: Syötä palvelun nimi

source: Service Category
fi: Palveluluokka

source: Select Category
fi: Valitse kategoria

source: Category
fi: Kategoria

source: One or more appointments are associated with this service,
fi: Tähän palveluun liittyy yksi tai useampi tapaaminen,

source: so you will not be able to delete it
fi: joten et voi poistaa sitä

source: Disable Service
fi: Poista palvelu käytöstä

source: Disable
fi: Poista käytöstä

source: Are you sure you want to disable service?
fi: Haluatko varmasti poistaa palvelun käytöstä?

source: Enable Service
fi: Ota palvelu käyttöön

source: Enable
fi: Ota käyttöön

source: Are you sure you want to enable service?
fi: Haluatko varmasti ottaa palvelun käyttöön?

source: Duplicate
fi: Monista

source: Shift Management
fi: Työvuorojen hallinta

source: Are you sure you want to delete this service?
fi: Haluatko varmasti poistaa tämän palvelun?

source: No Records Found!
fi: Tietueita ei löytynyt!

source: Start by clicking the Add New button
fi: Aloita napsauttamalla Lisää uusi -painiketta

source: Category Name
fi: Kategorian nimi

source: Total Services
fi: Palveluita yhteensä

source: Are you sure you want to delete this category?
fi: Haluatko varmasti poistaa tämän kategorian?

source: Add Category
fi: Lisää kategoria

source: Edit Category
fi: Muokkaa kategoriaa

source: Enter Category Name
fi: Syötä kategorian nimi

source: Add Service
fi: Lisää palvelu

source: Edit Service
fi: Muokkaa palvelua

source: Please upload jpg/png file
fi: Lataa jpg/png-tiedosto

source: Service Name:
fi: Palvelun nimi:

source: Category:
fi: Kategoria:

source: Price:
fi: Hinta:

source: Buffer Time Before:
fi: Puskuriaika ennen:

source: Buffer Time After:
fi: Puskuriaika jälkeen:

source: Min Capacity:
fi: Min kapasiteetti:

source: Max Capacity:
fi: Maksimikapasiteetti:

source: Description:
fi: Kuvaus:

source: Set start and expiry date for the service
fi: Aseta palvelun alkamis- ja päättymispäivä

source: Service Start Date (optional)
fi: Palvelun alkamispäivä (valinnainen)

source: Select Date
fi: Valitse päivämäärä

source: Service Expiration Date (optional)
fi: Palvelun päättymispäivä (valinnainen)

source: Configure Deposit options for the service
fi: Määritä palvelun talletusasetukset

source: Deposit Type
fi: Talletuksen tyyppi

source: Fixed Amount
fi: Kiinteä määrä

source: Percentage
fi: Prosentti

source: Deposit Amount:
fi: Talletuksen määrä:

source: Deposit Amount
fi: Talletuksen määrä

source: Extra Services
fi: Lisäpalvelut

source: No Extra Services Found
fi: Lisäpalveluita ei löytynyt

source: Maximum Quantity
fi: Enimmäismäärä

source: Service Settings
fi: Palveluasetukset

source: Minimum time required before booking:
fi: Vähimmäisaika vaadittu ennen varauksen tekemistä:

source: Minimum time required before rescheduling:
fi: Vähimmäisaika, joka tarvitaan ennen aikataulun muuttamista:

source: Minimum time required before cancelling:
fi: Vähimmäisaika ennen varauksen peruutusta:

source: Edit Extra Service
fi: Muokkaa lisäpalvelua

source: Add Extra Service
fi: Lisää lisäpalvelu

source: Service Title
fi: Palvelun otsikko

source: Enter Service Title
fi: Syötä palvelun otsikko

source: Leave it 0 to hide extra duration.
fi: Jätä 0 piilottaaksesi ylimääräisen keston.

source: Service Price
fi: Palvelun hinta

source: Enter Service Price
fi: Syötä palvelun hinta

source: Leave it 1 to hide extra quantity.
fi: Jätä 1 piilottaaksesi ylimääräisen määrän.

source: Service Description
fi: Palvelun kuvaus

source: Enter Service Description
fi: Syötä palvelun kuvaus

source: Working Hours
fi: Työajat

source: Configure Hours
fi: Määritä tunnit

source: Configure service specific work hours
fi: Palvelukohtaisten työaikojen määrittäminen

source: Breaks
fi: Tauot

source: Add Break
fi: Lisää tauko

source: Special Days
fi: Erityispäivät

source: All Special Days
fi: Kaikki erikois päivät

source: No Special Days Available
fi: Erityispäiviä ei saatavilla

source: Workhours
fi: Työtunnit

source: Holidays
fi: Lomapäivät

source: All Holiday
fi: Kaikki lomat

source: No Holiday Available
fi: Lomia ei saatavilla

source: Holiday Name
fi: Loman nimi

source: Repeat Holiday
fi: Toista loma

source: Edit Break
fi: Muokkaa taukoa

source: Add Special Days
fi: Lisää erikoispäiviä

source: Edit Special Days
fi: Muokkaa erikoispäiviä

source: Add Breaks
fi: Lisää taukoja

source: Add Holiday
fi: Lisää loma

source: Edit Holiday
fi: Muokkaa lomaa

source: Holiday Name:
fi: Loman nimi:

source: Enter holiday name
fi: Kirjoita loman nimi

source: Repeat Every
fi: Toista jokainen

source: Enter Holiday Repeat Frequency
fi: Syötä lomien toistoväli

source: Holiday Repeat Times
fi: Toista loma ajat

source: Holiday Repeat Date
fi: Loma Toista päivä(t)

source: Company Details
fi: Yrityksen tiedot

source: Enter company name
fi: Kirjoita yrityksen nimi

source: Address
fi: Osoite

source: Enter company address
fi: Kirjoita yrityksen osoite

source: Website
fi: Verkkosivu

source: Enter company website
fi: Kirjoita yrityksen verkkosivusto

source: Company Icon
fi: Yrityksen kuvake

source: jpg/png/webp files with a size less than 500kb
fi: jpg/png/webp-tiedostot, joiden koko on alle 500KB

source: Customer Settings
fi: Asiakasasetukset

source: Create WordPress user upon appointment booking
fi: Luo WordPress-käyttäjä ajanvarauksen yhteydessä

source: Auto login user after successful booking
fi: Kirjaa käyttäjän onnistuneen varauksen jälkeen automaattisesti

source: Custom Field Settings
fi: Mukautettujen kenttien asetukset

source: No Customer Field added!
fi: Asiakaskenttää ei ole lisätty!

source: Holiday Settings
fi: Lomapäivien asetukset

source: Edit holiday
fi: Muokkaa lomaa

source: Add holiday
fi: Lisää loma(t)

source: Debug Log
fi: Vianjäljitysloki

source: Debug Log Settings
fi: Vianmäärityslokin asetukset

source: Payment Debug Logs
fi: Maksujen vianmäärityslokit

source: On Site method
fi: Paikan päällä -menetelmä

source: On-Site
fi: Paikan päällä

source: Download log
fi: Lataa loki

source: Clear log
fi: Tyhjennä loki

source: method
fi: metodi

source: Integration Debug Logs
fi: Integraatioiden vianmäärityslokit

source: Appointment Debug Logs
fi: Ajanvarauksien vianmäärityslokit

source: Appointment Logs
fi: Ajanvarauksen lokit

source: Email Notification Debug Logs
fi: Sähköposti-ilmoitusten vianmäärityslokit

source: Email Notification Logs
fi: Sähköposti-ilmoituslokit

source: Email Notification
fi: Sähköposti-ilmoitus

source: Debug Logs
fi: Vianmäärityslokit

source: Log Id
fi: Lokitunnus

source: Log Name
fi: Lokin nimi

source: Log Data
fi: Lokitiedot

source: Log Added Date
fi: Loki lisätty päivämäärä

source: General Settings
fi: Yleiset asetukset

source: Global Settings
fi: Yleiset asetukset

source: Default Service Duration
fi: Palvelun oletusarvoinen kesto

source: Default Time Slot Step
fi: Aikavälin oletusaskel

source: Share Capacity between timeslots
fi: Kapasiteetin jakaminen aikavälien välillä

source: Show time as per service duration
fi: Näytä aika palvelun keston mukaan

source: Afternoon Start Time
fi: Iltapäivä Aloitusaika

source: Evening Start Time
fi: Aloitusaika iltaisin

source: Night Start Time
fi: Yö Aloitusaika

source: Default Phone Country Code
fi: Oletus maakoodi puhelinnumerolle

source: Identify country code by user's IP address
fi: Tunnista sijainti käyttäjän IP-osoitteesta

source: Default country as selected below
fi: Oletusmaa, joka on valittu jäljempänä

source: Payment Mode
fi: Maksutapa

source: Default items per page
fi: Kohteiden oletusmäärä sivulla

source: Data Export Delimiter
fi: Tietojen viennin erotin

source: Default Date Format
fi: Päivämäärän oletusmuoto

source: Default Time Format
fi: Oletusaikaformaatti

source: 12 hour Format
fi: 12 tunnin formaatti

source: 24 hour Format
fi: 24 tunnin formaatti

source: Complete Payment Page Selection
fi: Valitse sivu jolla maksu suoritetaan loppuun

source: Show booking-slots in client timezone
fi: Näytä varaukset asiakkaan omassa aikavyöhykkeessä

source: Note:
fi: Huomautus:

source: Please note that In the BookingPress, you will see all the date and time according to WordPress time zone ( WordPress -> Settings -> General -> Timezone ) on the backend and on the frontend, customers will see the date and time according to their System's time zone.
fi: Huomaa, että BookingPressissä näet kaikki päivämäärät ja kellonajat WordPressin aikavyöhykkeen mukaan ( WordPress -> Asetukset -> Yleiset -> Aikavyöhyke ) backendissä ja frontendissä, asiakkaat näkevät päivämäärän ja kellonajan järjestelmän aikavyöhykkeen mukaan.

source: Load JS &amp; CSS in all pages
fi: Lataa JS &amp; CSS kaikilla sivuilla

source: Help us improve BookingPress by sending anonymous usage stats
fi: Auta meitä parantamaan BookingPressiä lähettämällä nimettömiä käyttötilastoja

source: Enable Debug Mode
fi: Ota vianmääritystila käyttöön

source: BookingPress Loader
fi: BookingPress lataaja

source: Appointment Settings
fi: Ajanvarauksen asetukset

source: Default Appointment Status
fi: Ajanvarauksen oletustila

source: Appointment status paid with 'On site' payment method
fi: Ajanvaraus maksettu "paikan päällä" maksutavalla

source: Minimum time required before booking
fi: Vähimmäisaika ennen varausta

source: Minimum time required before canceling
fi: Vähimmäisaika ennen peruuttamista

source: Minimum time required before rescheduling
fi: Vähimmäisaika ennen aikataulun muuttamista

source: Period available for booking in advance
fi: Ajanjakso, joka on varattavissa etukäteen

source: Share timeslot between all services
fi: Jaa aikaväli kaikkien muiden palvelujen kesken

source: This option will get the highest priority over all the options while booking. Capacity will be ignored when this option is Enabled
fi: Tämä vaihtoehto on etusijalla kaikkiin vaihtoehtoihin nähden varauksen aikana. Kapasiteetti jätetään huomiotta, kun tämä vaihtoehto on käytössä

source: Share time across all services
fi: Jaa aika kaikkien palvelujen kesken

source: Share time across category
fi: Jaa aikaa eri luokkiin

source: License Details
fi: Lisenssin tiedot

source: Select Your Package
fi: Valitse pakettisi

source: License key
fi: Lisenssiavain

source: Enter License Key
fi: Syötä lisenssiavain

source: No. of activation allowed
fi: Sallittujen aktivointien määrä

source: Expires
fi: Vanhenee

source: Deactivate License
fi: Poista lisenssi käytöstä

source: Activate License
fi: Aktivoi lisenssi

source: Refresh License
fi: Päivitä lisenssi

source: Messages
fi: Viestit

source: Message Settings
fi: Viestiasetukset

source: No service selected for the booking
fi: Varaukselle ei ole valittu palvelua

source: No appointment date selected for the booking
fi: Varauspäivää ei ole valittu

source: No appointment time selected for the booking
fi: Varausaikaa ei ole valittu

source: No payment method is selected for the booking
fi: Varaukselle ei ole valittu maksutapaa

source: Duplicate email address found
fi: Toistuva sähköpostiosoite löytyi

source: Unsupported currency selected for the payment
fi: Maksua varten valittu tukematon valuutta

source: Time slot already booked
fi: Aikaväli on jo varattu

source: No payment method available
fi: Maksutapaa ei ole saatavilla

source: selected for the booking
fi: valittu varausta varten

source: Payment token failure message
fi: Maksutunnisteen epäonnistumisviesti

source: Payment already paid message
fi: Maksu on jo maksettu viesti

source: No timeslots available for booking
fi: Varattavissa olevia aikoja ei ole

source: No Appointment Available to Cancel
fi: Ei tapaamista peruttavissa

source: Email Notification Settings
fi: Sähköposti-ilmoituksen asetukset

source: It seems that the email upon booking could not be sent. Your site may not be correctly configured to send emails. Please check the following error message
fi: Näyttää siltä, että varauksen yhteydessä lähetettyä sähköpostia ei voitu lähettää. Sivustoasi ei ehkä ole määritetty oikein sähköpostien lähettämistä varten. Tarkista seuraava virheilmoitus

source: Email delivery method
fi: Sähköpostin toimitustapa

source: WordPress default
fi: WordPressin oletusarvo

source: PHP mail() function
fi: PHP:n mail()-funktio

source: SMTP method
fi: SMTP-menetelmä

source: The Gmail mailer works well for sites that send low numbers of emails. However, Gmail's API has rate limitations and a number of additional restrictions that can lead to challenges during setup. If you expect to send a high volume of emails, or if you find that your web host is not compatible with the Gmail API restrictions, then we recommend considering a different mailer option.
fi: Gmail-postitusohjelma toimii hyvin sivustoille, jotka lähettävät vain vähän sähköposteja. Gmailin API:ssa on kuitenkin nopeusrajoituksia ja useita lisärajoituksia, jotka voivat aiheuttaa haasteita asennuksen aikana. Jos aiot lähettää suuria määriä sähköposteja tai jos huomaat, että web-hostisi ei ole yhteensopiva Gmailin API-rajoitusten kanssa, suosittelemme harkitsemaan toista postilaitevaihtoehtoa.

source: Sender name
fi: Lähettäjän nimi

source: Enter sender name
fi: Kirjoita lähettäjän nimi

source: Sender email
fi: Lähettäjän sähköpostiosoite

source: Admin email
fi: Admin sähköpostiosoite

source: Enter admin email
fi: Syötä ylläpitäjän sähköpostiosoite

source: Host name
fi: Isäntäntänimi

source: Port
fi: Portti

source: Secure connection
fi: Suojattu yhteys

source: Select secure
fi: Valitse turvallinen

source: Client ID
fi: Asiakkaan ID

source: Client Secret
fi: Client Secret -koodi

source: Authorized redirect URI
fi: Valtuutettu uudelleenohjaus URI

source: Authentication Token
fi: Todennuskoodi

source: Send test email notification
fi: Lähetä testi sähköposti-ilmoitus

source: Message
fi: Viesti

source: Send Test Email
fi: Lähetä testisähköposti

source: Test Email Sent Successfully
fi: Testisähköposti lähetetty onnistuneesti

source: Send Test Email Notification
fi: Lähetä testi sähköposti-ilmoitus

source: Click here to see the full log
fi: Klikkaa tästä nähdäksesi koko loki

source: SMTP Test Full Log
fi: SMTP-testin koko loki

source: Opt-ins
fi: Tilaukset

source: Payment Settings
fi: Maksuasetukset

source: Some of the payment gateways do not support full or partial refund facility. Please check more information at our documentation
fi: Jotkin maksuportaat eivät tue täyttä tai osittaista palautusta. Tarkista lisätietoja dokumentaatiostamme

source: Here
fi: Täältä

source: Currency Settings
fi: Valuutan asetukset

source: Currency
fi: Valuutta

source: Currency symbol position
fi: Valuuttasymbolin sijainti

source: Currency separator
fi: Valuutan erotin

source: Thousand Separator
fi: Tuhaterotin

source: Enter Thousand Separator
fi: Syötä tuhannen erotin

source: Decimal Separator
fi: Desimaalierotin

source: Enter Decimal Separator
fi: Syötä desimaalierotin

source: Number of decimals
fi: Desimaalien määrä

source: Appointment Cancellation Refund Policy
fi: Tapaamisen peruutuksen hyvityskäytäntö

source: Allow Refund On Appointment Cancellation (From Frontend)
fi: Salli hyvitys ajanvarauksen peruutuksesta (Frontendistä)

source: Full Refund
fi: Täysi palautus

source: Partial Refund
fi: Osittainen palautus

source: Refund Before X Hour\Days Of Appointment
fi: Palautus ennen X tuntia\Päivää ennen varausta

source: Deduction From Paid Amount
fi: Vähennys maksetusta määrästä

source: Hour\Days Before Appointment
fi: Tunti\Päiviä ennen varausta

source: Amount Deduction
fi: Vähennyksen määrä

source: Apply refund rules on partially paid/deposit transactions?
fi: Sovelletaanko palautussääntöjä osittain maksettuihin/talletettuihin tapahtumiin?

source: Payment Method Settings
fi: Maksutapojen asetukset

source: Enter Client ID
fi: Syötä asiakkaan ID

source: Enter Client Secret
fi: Client Secret -koodi

source: Merchant Email
fi: Kauppiaan sähköpostiosoite

source: Enter email
fi: Syötä sähköpostiosoite

source: API Username
fi: API-käyttäjänimi

source: Enter username
fi: Anna käyttäjänimi

source: API Password
fi: API-salasana

source: Enter password
fi: Syötä salasana

source: API Signature
fi: API-allekirjoitus

source: Enter API signature
fi: Anna API-allekirjoitus

source: It is advised to use the Pop-up method rather than the legacy method although both work fine but as PayPal believes it is better to use the Pop-up method.
fi: On suositeltavaa käyttää pikemminkin Pop-up-menetelmää kuin perinteistä menetelmää, vaikka molemmat toimivat hyvin, mutta PayPalin mielestä on parempi käyttää Pop-up-menetelmää.

source: Special days
fi: Erityispäivät

source: Enable Any
fi: Ota käyttöön mikä tahansa

source: option
fi: vaihtoehto

source: you have hidden the staff member selection at the frontend
fi: olet piilottanut henkilökunnan jäsenen valinnan etusivulla

source: so you will not be able to turn this switch OFF.
fi: joten tätä kytkintä ei voi kytkeä POIS päältä.

source: Auto assignment rule
fi: Automaattisen määrityksen sääntö

source: Allow
fi: Salli

source: to Access wordpress admin panel
fi: pääsy wordpressin hallintapaneeliin
