Repository: Markus-web/BookingPress-Finnish-Translation
Catalog: Pro/bookingpress-appointment-booking-*.po
Languages: fi

source: Please enter coupon code
fi: Ole hyvä ja syötä kuponkikoodi

source: Please enter coupon discount
fi: Ole hyvä ja syötä alennuksen määrä

source: Please select coupon discount type
fi: Valitse alennuskupongin tyyppi

source: Please select coupon start date
fi: Valitse kupongin alkamispäivä

source: Please select coupon end date
fi: Valitse kupongin päättymispäivä

source: Every 05 minutes
fi: 5 minuutin välein

source: Please fill out all required fields.
fi: Täytä kaikki vaaditut kentät.

source: Email address already exits.
fi: Sähköpostiosoite on jo olemassa.

source: Please enter a valid email address.
fi: Syötä kelvollinen sähköpostiosoite.

source: Something wrong user not created.
fi: Jotain meni vikaan käyttäjää ei luotu.

source: Phone
fi: Puhelin

source: Last Appointment
fi: Viimeisin varaus

source: Total Appointments
fi: Ajanvarauksia yhteensä

source: Countries
fi: Maat

source: U.S. States
fi: Yhdysvaltain osavaltiot

source: U.S. State Abbreviations
fi: Yhdysvaltain osavaltioiden lyhenteet

source: Age Group
fi: Ikäryhmä

source: Satisfaction
fi: Tyytyväisyys

source: Week Days
fi: Viikonpäivät

source: Months
fi: Kuukautta

source: Years
fi: Vuotta

source: Prefix
fi: Etuliite

source: Telephone Country Code
fi: Puhelinnumeron maakoodi

source: Invalid file selected
fi: Virheellinen tiedosto valittu

source: Browse
fi: Selaa

source: Please select preset option
fi: Valitse esiasetusvaihtoehto

source: Under 18
fi: Alle 18

source: 65 or above
fi: 65 vuotta tai enemmän

source: Very Satisfied
fi: Erittäin tyytyväinen

source: Satisfied
fi: Tyytyväinen

source: Neutral
fi: Ei samaa eikä eri mieltä

source: Unsatisfied
fi: Tyytymätön

source: Very Unsatisfied
fi: Erittäin tyytymätön

source: Sunday
fi: Sunnuntai

source: Monday
fi: Maanantai

source: Tuesday
fi: Tiistai

source: Wednesday
fi: Keskiviikko

source: Thursday
fi: Torstai

source: Friday
fi: Perjantai

source: Saturday
fi: Lauantai

source: January
fi: Tammikuu

source: February
fi: Helmikuu

source: March
fi: Maaliskuu

source: April
fi: Huhtikuu

source: May
fi: Toukokuu

source: June
fi: Kesäkuu

source: July
fi: Heinäkuu

source: August
fi: Elokuu

source: September
fi: Syyskuu

source: October
fi: Lokakuu

source: November
fi: Marraskuu

source: December
fi: Joulukuu

source: Mr
fi: Herra

source: Mrs
fi: Rouva

source: Miss
fi: Nti

source: Preset Values Applied successfully
fi: Esiasetetut arvot lisätty onnistuneesti

source: Finland
fi: Suomi

source: Hour
fi: Tunti

source: Deposit title
fi: Talletuksen otsikko

source: Full payment title
fi: Täydellinen maksun nimi

source: Deposit Payment Settings
fi: Talletuksen maksuasetukset

source: Allow Customers To Pay
fi: Salli asiakkaiden maksaa

source: Deposit Only
fi: Vain talletus

source: Allow Customer To pay Full Amount
fi: Salli asiakkaan maksaa koko summa

source: Deposit amount must be less than or equal to service price
fi: Talletussumman on oltava enintään palvelun hinnan suuruinen

source: Minutes
fi: Minuuttia

source: No-Show
fi: Ei ilmestynyt

source: Completed
fi: Suoritettu

source: Refunded
fi: Hyvitetty

source: Partially Paid
fi: Osittain maksettu

source: Refunded ( partial )
fi: Palautettu ( osittain )

source: Multi-Language
fi: Monikielinen

source: Service Package
fi: Palvelupaketti

source: Location
fi: Sijainti

source: Recurring Appointments
fi: Toistuvat varaukset

source: Tip
fi: Anna tippi

source: Advanced Discount
fi: Edistyksellinen alennus

source: Cart
fi: Ostoskori

source: Waiting List
fi: Odotuslista

source: Custom Service Duration
fi: Mukautetun palvelun kesto

source: Invoice
fi: Lasku/kuitti

source: Google Calendar
fi: Google-kalenteri

source: Outlook Calendar
fi: Outlook-kalenteri

source: Conversion Tracking
fi: Konversioseuranta

source: Gift Card
fi: Lahjakortti

source: Services, Staff Members & Location
fi: Palvelut, henkilökunta ja sijainti

source: Services & Staff Members
fi: Palvelut ja henkilökunta

source: Packages
fi: Paketit

source: Multi Language Data
fi: Monikieliset tiedot

source: Table Not Exists.
fi: Taulukkoa ei ole olemassa.

source: No Record Found.
fi: Tietuetta ei löytynyt.

source: Import/Export Debug Logs
fi: Tuo/vie vianmäärityslokit

source: Export Logs
fi: Vie lokit

source: View log
fi: Näytä loki

source: Select log duration to download
fi: Valitse ladattavan lokin kesto

source: Start date
fi: Alkamispäivä

source: End date
fi: Päättymispäivä

source: Download
fi: Lataa

source: Download Log
fi: Lataa loki

source: Are you sure you want to clear debug logs?
fi: Oletko varma, että haluat tyhjentää debug-lokit?

source: Clear Log
fi: Tyhjennä loki

source: Import Logs
fi: Tuo Järjestelmälokit

source: Please enter name
fi: Ole hyvä ja kirjoita nimi

source: To Customer
fi: Asiakkaalle

source: To Admin
fi: Ylläpitäjälle

source: Email notifications details update successfully.
fi: Sähköposti-ilmoitusten tiedot päivitetty onnistuneesti.

source: Notification Name is already exist.
fi: Ilmoituksen nimi on jo olemassa.

source: Email notifications Update successfully.
fi: Sähköposti-ilmoitukset päivitetty onnistuneesti.

source: Email notifications create successfully.
fi: Sähköposti-ilmoitukset on luotu onnistuneesti.

source: Data received successfully
fi: Tiedot vastaanotettu onnistuneesti

source: No data received
fi: Tietoja ei vastaanotettu

source: Notification has been deleted successfully.
fi: Ilmoitus on poistettu onnistuneesti.

source: Staff Members Updated Successfully
fi: Henkilökunnan jäsenet päivitetty onnistuneesti

source: Something went wrong while sending payment link
fi: Jokin meni pieleen maksulinkkiä lähetettäessä

source: Payment Link Send Successfully
fi: Maksulinkki lähetetty onnistuneesti

source: Please select any method for send payment link
fi: Valitse mikä tahansa maksutapa maksulinkin lähetykseen

source: Customer First Name
fi: Asiakkaan etunimi

source: Customer Last Name
fi: Asiakkaan sukunimi

source: Customer Email
fi: Asiakkaan sähköposti

source: Transaction Id
fi: Maksutapahtuman ID

source: Payer Email
fi: Maksajan sähköposti

source: Payment Date
fi: Maksupäivämäärä

source: Payment Status
fi: Maksun tilanne

source: Payment status has been change successfully.
fi: Maksun tila on muutettu onnistuneesti.

source: On Site
fi: Paikan päällä

source: Something went wrong while processing the double booking refund
fi: Jokin meni pieleen tuplavarauksen palautusta käsiteltäessä

source: Refund successfully initiated
fi: Palautus onnistuneesti aloitettu

source: Appointment Cancellation Notification
fi: Ilmoitus ajanvarauksen peruuttamisesta

source: Dear %customer_first_name% %customer_last_name%,<br/><br/>This is regarding your recent payment and appointment scheduling with the below details which is not successfully booked, despite your payment being processed due to unforeseen technical glitches.<br/><br/>%service_name% - %appointment_date_time% - %appointment_amount%<br/><br/>We will process the refund for the full amount of your payment and it will be credited back to your account within the next 4-7 business days. We truly regret any inconvenience this may have caused you and understand the importance of having a smooth and hassle-free experience with our services.<br/><br/>Best regards,<br/>%company_name%<br/>%company_address%<br/>%company_phone%<br/>%company_website%
fi: Hyvä %customer_first_name% %customer_last_name%,<br/><br/>Tämä koskee äskettäistä maksuasi ja varaustasi alla olevilla tiedoilla, joita ei ole onnistuttu varaamaan, vaikka maksusi on käsitelty odottamattomien teknisten häiriöiden vuoksi.<br/><br/>%service_name% - %appointment_date_time% - %appointment_amount%<br/><br/>Käsittelemme maksunne koko summan palautuksen ja se hyvitetään tilillenne seuraavien 4-7 arkipäivän aikana. Pahoittelemme todella kaikkia tästä sinulle mahdollisesti aiheutuneita haittoja ja ymmärrämme, että on tärkeää, että palvelumme ovat sujuvia ja vaivattomia.<br/><br/>Ystävällisin terveisin,<br/>%company_name%<br/>%company_address%<br/>%company_phone%<br/>%company_website%

source: Appointment cancelled due to conflict
fi: Ajanvaraus peruutettu konfliktin vuoksi

source: Dear Administrator,<br/>One of the recently booked appointment has conflict with another appointment with booking ID - %bookingpress_appointment_id% on our booking platform. So, the system has automatically initiated a refund for the payment of %appointment_amount% to avoid any double bookings.<br/><br/>Below are the appointment and payment details for your reference:<br/>Appointment Date: %appointment_date%<br/>Appointment Time: %appointment_time%<br/>Payment ID: %transaction_id%<br/>Payment Amount: %appointment_amount%<br/>Payment Gateway:%bookingpress_payment_gateway%<br/>First name & Last name: %customer_first_name% %customer_last_name%,<br/>Customer Full Name: %customer_full_name%<br/>Customer Email: %customer_email%<br/>Customer Phone: %customer_phone%<br/><br/>Best regards,<br/>%company_name%<br/>%company_address%<br/>%company_phone%<br/>%company_website%
fi: Hyvä ylläpitäjä,<br/>Yksi äskettäin varatuista tapaamisista on ristiriidassa toisen tapaamisen kanssa, jonka varausnumero on %bookingpress_appointment_id% varausalustallamme. Niinpä järjestelmä on automaattisesti käynnistänyt palautuksen maksusta %appointment_amount%, jotta vältytään kaksinkertaisilta varauksilta.<br/><br/>Alla on ajanvarauksen ja maksun tiedot viitteeksi:<br/>Ajanvarauksen päivämäärä: %appointment_date%<br/>Ajanvarausaika: %appointment_time%<br/>Maksutunnus: %transaction_id%<br/>Maksun määrä: %appointment_amount%<br/>Payment Gateway:%bookingpress_payment_gateway%<br/>Etu- ja sukunimi: %customer_first_name% %customer_last_name%,<br/>Asiakkaan täydellinen nimi: %customer_full_name%<br/>Asiakkaan sähköpostiosoite: %customer_email%<br/>Asiakkaan puhelin: %customer_phone%<br/><br/>Ystävällisin terveisin,<br/>%company_name%<br/>%company_address%<br/>%company_phone%<br/>%company_website%

source: Dear Administrator,<br/>One of the recently booked appointment has conflict with another appointment with booking ID - %bookingpress_appointment_id% on our booking platform. So, an immediate action is required to handle the refund process for their payment.<br/><br/>Below are the appointment and payment details for your reference:<br/>Appointment Date: %appointment_date%<br/>Appointment Time: %appointment_time%<br/>Payment ID: %transaction_id%<br/>Payment Amount: %appointment_amount%<br/>Payment Gateway:%bookingpress_payment_gateway%<br/>First name & Last name: %customer_first_name% %customer_last_name%,<br/>Customer Full Name: %customer_full_name%<br/>Customer Email: %customer_email%<br/>Customer Phone: %customer_phone%<br/><br/>Best regards,<br/>%company_name%<br/>%company_address%<br/>%company_phone%<br/>%company_website%
fi: Hyvä ylläpitäjä,<br/>Yksi äskettäin varatuista tapaamisista on ristiriidassa toisen tapaamisen kanssa, jonka varausnumero on %bookingpress_appointment_id% varausalustallamme. Tarvitaan siis välittömiä toimia, jotta maksun palautusprosessi voidaan hoitaa.<br/><br/>Alla on ajanvarauksen ja maksun tiedot viitteeksi:<br/>Ajanvarauksen päivämäärä: %appointment_date%<br/>Ajanvarausaika: %appointment_time%<br/>Maksutunnus: %transaction_id%<br/>Maksun määrä: %appointment_amount%<br/>Payment Gateway:%bookingpress_payment_gateway%<br/>Etu- ja sukunimi: %customer_first_name% %customer_last_name%,<br/>Asiakkaan täydellinen nimi: %customer_full_name%<br/>Asiakkaan sähköpostiosoite: %customer_email%<br/>Asiakkaan puhelin: %customer_phone%<br/><br/>Ystävällisin terveisin,<br/>%company_name%<br/>%company_address%<br/>%company_phone%<br/>%company_website%

source: Sorry, Your request can not be processed.
fi: Valitettavasti pyyntöäsi ei voitu käsitellä.

source: Data re-calculated successfully...
fi: Tiedot laskettu uudelleen onnistuneesti...

source: There is a new version of %1$s available.
fi: Saatavilla on uusi versio %1$s.

source: Contact your network administrator to install the update.
fi: Ota yhteyttä sivuston ylläpitäjään päivityksen asentamiseksi.

source: %1$sView version %2$s details%3$s.
fi: %1$sNäytä version %2$s lisätiedot%3$s.

source: %1$sView version %2$s details%3$s or %4$supdate now%5$s.
fi: %1$sNäytä version %2$s lisätiedot%3$s tai %4$späivitä nyt%5$s.

source: Update now.
fi: Päivitä nyt.

source: You do not have permission to install plugin updates
fi: Sinulla ei ole oikeuksia päivittää lisäosia

source: Total Appointment
fi: Ajanvarauksia yhteensä

source: Total Revenue
fi: Tulot yhteensä

source: Existing Customers
fi: Olemassa olevat asiakkaat

source: New Customers
fi: Uudet asiakkaat

source: Today
fi: Tänään

source: Yesterday
fi: Eilen

source: Tomorrow
fi: Huomenna

source: This week
fi: Tällä viikolla

source: Last week
fi: Viime viikolla

source: This month
fi: Tässä kuussa

source: Last month
fi: Viime kuussa

source: This year
fi: Tänä vuonna

source: Service extra title
fi: Palvelun ylimääräinen nimike

source: Service extras label
fi: Palvelun lisämerkintä

source: Assigned extra service formatted successfully
fi: Määritetty lisäpalvelu muotoiltu onnistuneesti

source: Please enter service title
fi: Kirjoita palvelun otsikko

source: Please select service duration
fi: Valitse palvelun kesto

source: Please enter service price
fi: Syötä palvelun hinta

source: Extra services retrieved successfully
fi: Lisäpalvelut haettu onnistuneesti

source: Service extra duration cannot be greater than original service duration
fi: Lisäpalvelun kesto ei voi olla pidempi kuin alkuperäisen palvelun kesto

source: Details formatted successfully
fi: Tiedot muotoiltu onnistuneesti

source: Appointment(s) are already booked during this time duration. Do you still want to continue?
fi: Aika on jo varattu tämän ajanjakson aikana. Haluatko silti jatkaa?

source: success
fi: onnistui

source: Service min capacity should not be greater than max capacity.
fi: Palvelun vähimmäiskapasiteetti ei saa olla suurempi kuin enimmäiskapasiteetti.

source: The service start date should not be earlier than the service expiration date.
fi: Palvelun alkamispäivä ei saa olla aikaisempi kuin palvelun päättymispäivä.

source: The service start date should not be earlier than the current date.
fi: Palvelun alkamispäivä ei saa olla aikaisempi kuin nykyinen päivämäärä.

source: The service expiration date should not be earlier than the current date.
fi: Palvelun voimassaolon päättymispäivä ei saa olla aikaisempi kuin nykyinen päivämäärä.

source: Service Shift Managment data retrieve successfully
fi: Palveluaika -tietojen haku onnistui onnistuneesti

source: Assigned staffmember service formatted successfully
fi: Henkilöstön jäsenen palvelu on muotoiltu onnistuneesti

source: Shift management data updated successfully...
fi: Työajat päivitetty onnistuneesti...

source: Service status changed successfully
fi: Palvelun tila muuttui onnistuneesti

source: Staff member data retrieved successfully.
fi: Henkilöstön jäsenen tiedot haettu onnistuneesti.

source: No staffmember sevice data retrieved.
fi: Työntekijän palvelua koskevia tietoja ei haettu.

source: Add New
fi: Lisää uusi

source: Something went wrong.
fi: Jotain meni vikaan.

source: Service Special Day data retrieved successfully.
fi: Palvelun erityispäivän -tiedot haettu onnistuneesti.

source: Appointment(s) are already booked during this time duration for the service. Do you still want to continue?
fi: Aika on jo varattu tämän ajanjakson aikana palvelua varten. Haluatko silti jatkaa?

source: Start time & End time are not same
fi: Aloitusaika ja lopetusaika eivät ole samat

source: Please enter valid time for break
fi: Syötä kelvollinen aika taukoa varten

source: Break time already added
fi: Tauko on jo lisätty

source: Please Enter Start Time and End Time
fi: Syötä alkamisaika ja päättymisaika

source: Special days already exists
fi: Erityispäivät ovat jo olemassa

source: Holiday is already exists
fi: Loma on jo olemassa

source: Assign staff member min capacity should not be greater than max capacity.
fi: Henkilöstön jäsenen määrittäminen min-kapasiteetti ei saa olla suurempi kuin maksimikapasiteetti.

source: Please select staff member and input staff member price...
fi: Valitse henkilökunnan jäsen ja syötä henkilökunnan jäsenen hinta....

source: Staff member already assigned to this service.
fi: Työntekijä on jo lisätty tähän palveluun.

source: Special day is already exists.
fi: Erityispäivä on jo olemassa.

source: Holiday duration must be shorter than the repeat frequency
fi: Loman keston on oltava lyhyempi kuin toistotiheyden

source: Disabled
fi: Pois käytöstä

source: 1 h
fi: 1 t

source: 1 h 30 min
fi: 1 t 30 min

source: 2 h
fi: 2 t

source: 3 h
fi: 3 t

source: 6 h
fi: 6 t

source: 7 h
fi: 7 t

source: 8 h
fi: 8 t

source: 9 h
fi: 9 t

source: 10 h
fi: 10 t

source: 11 h
fi: 11 t

source: 12 h
fi: 12 t

source: 1 day
fi: 1 päivä

source: 2 days
fi: 2 päivää

source: 3 days
fi: 3 päivää

source: 4 days
fi: 4 päivää

source: 5 days
fi: 5 päivää

source: 6 days
fi: 6 päivää

source: 1 week
fi: 1 viikko

source: 2 week
fi: 2 viikkoa

source: 3 week
fi: 3 viikkoa

source: 4 week
fi: 4 viikkoa

source: 6 month
fi: 6 kuukautta

source: Inherit from general setting
fi: Peritään yleisistä asetuksista

source: Please enter start time
fi: Aseta aloitusaika

source: Please enter end time
fi: Aseta päättymisaika

source: Please select date
fi: Valitse päivämäärä

source: Select start time
fi: Valitse alkamisaika

source: Select end time
fi: Valitse päättymisaika

source: Please enter before buffer time
fi: Syötä ennen puskuriaikaa

source: Please enter after buffer time
fi: Syötä puskuriajan jälkeen

source: Please enter max capacity
fi: Aseta enimmäiskapasiteetti

source: Please enter min capacity
fi: Syötä min-kapasiteetti

source: Week
fi: Viikko

source: Month
fi: Kuukausi

source: Year
fi: Vuosi

source: Forever
fi: Ikuisesti

source: Specific No. of Times
fi: Erityinen määrä kertoja

source: Until
fi: Asti

source: Holiday already added.
fi: Loma on jo lisätty.

source: Holiday has been saved successfully.
fi: Loma on tallennettu onnistuneesti.

source: Please fill Break Title
fi: Täytä tauon Otsikko

source: DaysOff data retrieved successfully
fi: Vapaapäivän tiedot haettu onnistuneesti

source: Invalid file extension. Please select valid file
fi: Virheellinen tiedostopääte. Ole hyvä ja valitse kelvollinen tiedosto

source: Something went wrong while updating the file
fi: Jotain meni pieleen tiedostoa päivitettäessä

source: Something went wrong while processing this request
fi: Jokin meni vikaan tämän pyynnön käsittelyssä

source: This appears to be an invalid license key for %s.
fi: Tämä näyttää olevan virheellinen lisenssiavain %s.

source: error
fi: virhe

source: Sorry! It seems that license is not renewed yet.
fi: Pahoittelut! Näyttää siltä, että lisenssiä ei ole vielä uusittu.

source: License refreshed successfully
fi: Lisenssi päivitetty onnistuneesti

source: It seems that your BookingPress License is not active, to activate the License, click %1$shere%2$s.
fi: Näyttää siltä, että BookingPress-lisenssisi ei ole aktiivinen, aktivoi lisenssi klikkaamalla %1$stästä%2$s.

source: License deactivated successfully.
fi: Lisenssi poistettu käytöstä onnistuneesti.

source: License activated successfully.
fi: Lisenssi aktivoitu onnistuneesti.

source: Special day already exists.
fi: Erityispäivä on jo olemassa.

source: Please add at least one rule for partial refund paymemt.
fi: Lisää ainakin yksi sääntö osittaista palautusta varten.

source: Field deleted successfully
fi: Kenttä poistettu onnistuneesti

source: The field is already mapped with appointment booking form. Do you wish to delete this?
fi: Kenttä on jo yhdistetty ajanvarauslomakkeeseen. Haluatko silti poistaa sen?

source: Meta key already exists. Please select another value for meta key.
fi: Meta-avain on jo olemassa. Valitse meta-avaimelle toinen arvo.

source: Meta key is available
fi: Meta-avain on käytettävissä

source: Special days settings updated successfully.
fi: Erityispäivien asetukset päivitetty onnistuneesti.

source: Special Day data retrieved successfully.
fi: Erityispäivän tiedot haettu onnistuneesti.

source: one or more appointments are already booked this time duration still you want to add the Special day
fi: yksi tai useampi tapaaminen on jo varattu tältä ajalta, mutta haluatko silti lisätä erikoispäivän

source: Please upload jpg/png/webp file only
fi: Lataa vain jpg/png/webp-tiedosto

source: Please upload maximum 500 KB file only
fi: Lataa enintään 500 KB:n tiedosto

source: Partial refund rules already added
fi: Osittaista hyvitystä koskevat säännöt on jo lisätty

source: Duration must be less then 24 Hour
fi: Keston on oltava alle 24 tuntia

source: Duration must be less then 365 Days
fi: Keston on oltava alle 365 päivää

source: Please enter message
fi: Syötä viesti

source: disabled
fi: pois käytöstä

source: Least assigned by the day
fi: Päiväkohtaisesti vähiten määritetty

source: Most assigned by the day
fi: Eniten päiväkohtaisesti määritetty

source: Least assigned by the week
fi: Viikoittain vähiten määritetty

source: Most assigned by the week
fi: Viikoittain eniten määritetty

source: Most expensive
fi: Kallein

source: Least expensive
fi: Edullisin

source: Please enter refund duration
fi: Syötä palautuksen kesto

source: Please enter refund amount
fi: Syötä palautuksen määrä

source: Comma
fi: Pilkku

source: Semicolon
fi: Puolipiste

source: Please select start time
fi: Valitse alkamisaika

source: Please select end time
fi: Valitse päättymisaika

source: Please enter Holiday repeat frequency
fi: Syötä loman toistoväli

source: Please enter Holiday repeat duration
fi: Syötä Loman toistamisen kesto

source: Please choose date until you want to repeat the holiday.
fi: Valitse päivämäärä, kunnes haluat toistaa loman.

source: Staff step
fi: Henkilöstön askel

source: Staff member title
fi: Työntekijän titteli

source: No staff member selected for the booking
fi: Varausta varten ei ole valittu työntekijää

source: All Staff
fi: Koko henkilöstö

source: Assign
fi: Valitse

source: Select
fi: Valitse

source: Min Capacity
fi: Min kapasiteetti

source: Max Capacity
fi: Maksimikapasiteetti

source: Save
fi: Tallenna

source: Staff member already added to the location with same service
fi: Henkilöstön jäsen on jo lisätty paikkaan, jossa on sama palvelu

source: Staff member already added to the different location
fi: Henkilöstön jäsen on jo lisätty eri sijaintiin

source: No
fi: Ei

source: Assigned
fi: Määritetty

source: Name
fi: Nimi

source: Action
fi: Toiminto

source: Staffmember shift managment data retrieved successfully
fi: Henkilöstön työvuoronhallintatiedot haettu onnistuneesti

source: staffmember position has been changed successfully.
fi: toimihenkilön asema on vaihdettu onnistuneesti.

source: Selection
fi: Valinta

source: Assigned service formatted successfully
fi: Määritelty palvelu muotoiltu onnistuneesti

source: Something went wrong while processing with request
fi: Pahoittelut. Jokin meni pieleen pyynnön käsittelyssä

source: Staff member status changed successfully
fi: Työntekijän tila muutettu onnistuneesti

source: Please select one or more records.
fi: Valitse yksi tai useampi tietue.

source: Service min capacity should not be greater than max capacity
fi: Palvelun vähimmäiskapasiteetti ei saa olla suurempi kuin enimmäiskapasiteetti

source: Please select service and input service price...
fi: Valitse palvelu ja syötä palvelun hinta...

source: Service already assigned to a staff member
fi: Palvelu on jo osoitettu työntekijälle

source: Please Enter Password
fi: Ole hyvä ja syötä salasana

source: Assigned Services
fi: Määritettyä palvelua

source: Please assign service to Staff member
fi: Määritä palvelu henkilökunnan jäsenelle
