Repository: Markus-web/BookingPress-Finnish-Translation
Catalog: Pro/bookingpress-appointment-booking-*.po
Languages: fi

source: Firstname is too long...
fi: Etunimi on liian pitkä...

source: Lastname is too long...
fi: Sukunimi on liian pitkä...

source: Email address is too long...
fi: Sähköpostiosoite on liian pitkä...

source: Email address is already exists
fi: Sähköpostiosoite on jo olemassa

source: Shift management data updated successfully.
fi: Työajat päivitetty onnistuneesti...

source: Staff member has been updated succsssfully.
fi: Työntekijä on päivitetty onnistuneesti.

source: Staff member has been added succsssfully.
fi: Työntekijä on lisätty onnistuneesti.

source: Select Staffmember
fi: Valitse henkilökunnan jäsen

source: Select Existing User
fi: Valitse olemassa oleva käyttäjä

source: Staff Member Data.
fi: Työntekijän tiedot.

source: Daysoff data retrieved successfully.
fi: Vapaapäivän tiedot haettu onnistuneesti.

source: No daysoff data retrieved.
fi: Vapaapäivän tietoja ei haettu.

source: Staff member Special Day data retrieved successfully.
fi: Työntekijän erikoispäivän tiedot haettu onnistuneesti.

source: Assigned service data retrieved successfully.
fi: Määritetyt palvelutiedot haettu onnistuneesti.

source: Staff members has been deleted successfully.
fi: Henkilöstön jäsenet on poistettu onnistuneesti.

source: I am sorry
fi: Olen pahoillani

source: This staff member can not be deleted because it has one or more appointments associated with it
fi: Tätä työntekijää ei voida poistaa, koska siihen liittyy yksi tai useampi varaus

source: warning
fi: varoitus

source: Staff member has been deleted successfully.
fi: Henkilöstön jäsen on poistettu onnistuneesti.

source: Edit data retrieved successfully
fi: Muokkaus data haettu onnistuneesti

source: one or more appointments are already booked this time duration with this staffmember still you want to add the Special day
fi: yksi tai useampi tapaaminen on jo varattu tälle ajanjaksolle tämän työntekijän kanssa, mutta haluat silti lisätä erikoispäivän

source: Please assign staff member to service
fi: Määritä henkilökunnan jäsen palvelulle

source: Special Days Deleted Successfully
fi: Erityispäivät poistettu onnistuneesti

source: Specialdays saved successfully
fi: Erityispäivät tallennettu onnistuneesti

source: Days-off deleted successfully
fi: Vapaapäivät poistettu onnistuneesti

source: Daysoff detailed retrieved successfully
fi: Yksityiskohtaiset vapaapäivät haettu onnistuneesti

source: Staff member holiday added successfully
fi: Työntekijän loma lisätty onnistuneesti

source: Staff member holiday off updated successfully
fi: Työntekijän loma päivitetty onnistuneesti

source: Working Hours data updated successfully.
fi: Työtuntitiedot päivitetty onnistuneesti.

source: Sorry, Your rescedule token not valid.
fi: Anteeksi, varauksenuusimis-linkki ei ole voimassa.

source: Please select rescheduling time
fi: Valitse varaukselle uusi aika

source: Morning
fi: Aamupäivä

source: Afternoon
fi: Päivä

source: Evening
fi: Iltapäivä

source: Night
fi: Ilta

source: Reschedule appointment not allowed.
fi: Ajanvarauksen siirtäminen ei ole sallittua.

source: Something went wrong, please try again later
fi: Jokin meni pieleen, yritä myöhemmin uudelleen

source: d
fi: pv

source: Client timezone set successfully
fi: Asiakkaan aikavyöhyke asetettu onnistuneesti

source: Login Successfully
fi: Kirjautuminen onnistui

source: Something went wrong while get staff member services
fi: Jokin meni pieleen haettaessa henkilökunnan palveluita

source: Services retireved successfully
fi: Palvelut haettu onnistuneesti

source: Max capacity data retrieved successfully
fi: Maksimikapasiteettitiedot haettu onnistuneesti

source: Please select staff member to proceed further
fi: Valitse työntekijä jatkaaksesi eteenpäin

source: Disabled dates retrieved successfully
fi: Pois käytöstä otetut päivät haettu onnistuneesti

source: Price calculated successfully
fi: Hinta laskettu onnistuneesti

source: Sorry, You are not allowed to reschedule this appointment
fi: Pahoittelut, et voi siirtää tätä tapaamista

source: Sorry, You are not allowed to reschedule appointments
fi: Pahoittelut, et voi siirtää tapaamisia uudelleen

source: Sorry, minimum time for rescheduling appointment has been passed.
fi: Pahoittelut, vähimmäisaika ajanvarauksen siirtämiseen on kulunut.

source: Selected date & time is not valid.
fi: Valittu päivämäärä ja kellonaika ei ole kelvollinen.

source: Sorry, Booking can not be done as booking time is different than selected timeslot
fi: Valitettavasti varausta ei voida tehdä, koska varausaika on eri kuin valittu aikaväli

source: Enter phone number
fi: Syötä puhelinnumero

source: New password and confirm password must be same
fi: Uuden salasanan ja vahvistussalasanan on oltava samat

source: Sorry! Appointment could not be processed
fi: Pahoittelut! Ajanvarausta ei voitu käsitellä

source: Fullname is too long...
fi: Koko nimi on liian pitkä...

source: Sorry, Booking can not be done as the selected date is after the maximum available date
fi: Valitettavasti varausta ei voida tehdä, koska valittu päivämäärä on käytettävissä olevan enimmäispäivän jälkeen

source: On-site payment gateway is not active
fi: Paikan päällä oleva maksutapa ei ole aktiivinen

source: PayPal payment gateway is not active
fi: PayPal-maksutapa ei ole aktiivinen

source: Paypal supports minimum amount 0.1
fi: PayPalin tukema vähimmäissumma on 0.1

source: Selected date is off day
fi: Valittu päivä on vapaapäivä

source: So please select new date
fi: Joten valitse uusi päivä

source: Sorry, Booking can not be done as minimum required time before booking is already passed
fi: Valitettavasti varausta ei voida tehdä, koska vähimmäisaika ennen varauksen tekemistä on jo kulunut

source: Sorry, Booking can not be done as tax amount is incorrect
fi: Valitettavasti varausta ei voida tehdä, koska veron määrä on virheellinen

source: is off day
fi: on vapaapäivä

source: Someone requested that the password be reset for the following account:
fi: Joku pyysi, että seuraavan käyttäjätunnuksen salasana vaihdettaisiin:

source: Username: %s
fi: Käyttäjätunnus %s

source: If this was a mistake, just ignore this email and nothing will happen.
fi: Jos tämä oli virhe, jätä tämä sähköposti huomiotta, eikä sinun tarvitse tehdä mitään muuta.

source: To reset your password, visit the following address:
fi: Vaihtaaksesi salasanasi napsauta seuraavaa linkkiä:

source: [%s] Password Reset
fi: [%s] Salasanan vaihto

source: Sorry, File not found
fi: Pahoittelut, tiedostoa ei löydy

source: File removed successfully
fi: Tiedosto poistettu onnistuneesti

source: Sorry, Something went wrong while processing file upload.
fi: Pahoittelut, jokin meni pieleen tiedoston latauksen aikana.

source: No Data Found.
fi: Tietoja ei löytynyt.

source: Something went wrong while completing the payment
fi: Jokin meni pieleen maksun suorittamisen aikana

source: %1$s to %2$s
fi: %1$s - %2$s

source: Appointment Booking
fi: Ajanvaraus

source: Appointment succesfully created.
fi: Varaus luotu onnistuneesti.

source: Client ID is required.
fi: Asiakastunnus vaaditaan.

source: Client secret is required.
fi: Asiakassalaisuus vaaditaan.

source: Appointment successfully created.
fi: Varaus luotu onnistuneesti.

source: Sorry, payment is not successed with the paypal.
fi: Anteeksi, maksu ei ole onnistunut paypalin kanssa.

source: Sorry, Your request can not process due to security reason.
fi: Valitettavasti pyyntöäsi ei voida käsitellä turvallisuussyistä.

source: Appointment Booking (Multiple)
fi: Ajanvaraus (useita)

source: Access Token Not Valid
fi: Access Token ei ole voimassa

source: Sorry! refund could not be processed
fi: Pahoittelut! palautusta ei voitu käsitellä

source: Error Code
fi: Virhekoodi

source: Additional Modules
fi: Lisämoduulit

source: Activate
fi: Ota käyttöön

source: Deactivate
fi: Poista käytöstä

source: Configure
fi: Määritä

source: Read More
fi: Lue lisää

source: Feature Add-ons
fi: Ominaisuuden lisäosat

source: Payment Gateways
fi: Maksujen yhdyskäytävät

source: Integrations
fi: Integraatiot

source: Get
fi: Hanki

source: Manage Appointments
fi: Hallitse varauksia

source: Share URL
fi: Jaa URL-osoite

source: Appointment Date
fi: Ajanvarauksen päivä

source: Customer Name
fi: Asiakkaan nimi

source: Start typing to fetch Customer
fi: Kirjoita hakeaksesi asiakasta

source: Select Service
fi: Valitse palvelu

source: Status
fi: Tila

source: Select Status
fi: Valitse tila

source: All
fi: Kaikki

source: Appointment ID
fi: Ajanvarauksen ID

source: Search for Customers, Services...
fi: Etsi asiakkaita, palveluita...

source: Reset
fi: Tyhjennä

source: Export
fi: Vie

source: No Record Found!
fi: Tietueita ei löytynyt!

source: Booking ID
fi: Varauksen ID

source: Close
fi: Sulje

source: Are you sure you want to cancel this appointment?
fi: Haluatko varmasti peruuttaa tämän ajanvarauksen?

source: Basic Details
fi: Perustiedot

source: No. Of Person
fi: Henkilöiden lukumäärä

source: Customer Details
fi: Asiakastiedot

source: Qty:
fi: Määrä:

source: Custom Fields
fi: Mukautetut kentät

source: Payment Details
fi: Maksutiedot

source: Total Amount
fi: Kokonaissumma

source: Rescheduled
fi: Uudelleen ajoitettu

source: Change status
fi: Muuta tila

source: Payment
fi: Maksu

source: Cart Transaction
fi: Ostoskorin tapahtuma

source: Edit
fi: Muokkaa

source: Are you sure you want to delete this appointment?
fi: Haluatko varmasti poistaa tämän varauksen?

source: Showing
fi: Näytetään

source: Per Page
fi: Per sivu

source: Items Selected
fi: Valitut kohteet

source: Go
fi: Mene

source: Add Appointment
fi: Lisää ajanvaraus

source: Select Extras
fi: Valitse lisäpalvelut

source: View more
fi: Näytä lisää

source: View less
fi: Näytä vähemmän

source: Add
fi: Lisää

source: Add Extra
fi: Lisää lisäpalvelu

source: Select Customer
fi: Valitse asiakas

source: Allow Custom Duration
fi: Salli mukautettu kesto

source: Appointment Time
fi: Ajanvarauksen aika

source: Internal note
fi: Sisäinen huomautus

source: Do Not Send Notifications
fi: Älä lähetä ilmoituksia

source: Service Extras
fi: Palvelun lisäpalvelut

source: Have a coupon code?
fi: Onko sinulla kuponkikoodi?

source: Applied
fi: Lisätty

source: Total
fi: Yhteensä

source: Once appointment booked
fi: Kun tapaaminen on varattu

source: Send Payment Link
fi: Lähetä maksulinkki

source: Mark as paid
fi: Merkitse maksetuksi

source: Do Nothing
fi: Älä tee mitään

source: Through Email
fi: Sähköpostitse

source: Export Data
fi: Vie tiedot

source: Add Customer
fi: Lisää asiakas

source: Please upload jpg/png/webp file
fi: Lataa jpg/png/webp-tiedosto

source: WordPress User
fi: WordPress-käyttäjä

source: Start typing to fetch user.
fi: Aloita käyttäjän hakeminen kirjoittamalla.

source: Create New User
fi: Luo uusi käyttäjä

source: Create New
fi: Luo uusi

source: Enter Password
fi: Syötä salasana

source: Enter Username
fi: Kirjoita käyttäjänimi

source: Enter First Name
fi: Syötä etunimi

source: Enter Last Name
fi: Syötä sukunimi

source: Enter Email
fi: Syötä sähköposti

source: Share Appointment
fi: Jaa tapaaminen

source: Select Page
fi: Valitse sivu

source: Search for Page
fi: Etsi sivua

source: Select Staff
fi: Valitse henkilökunta

source: Load More
fi: Lataa lisää

source: Load Less
fi: Lataa vähemmän

source: Share With
fi: Jaa

source: Customer can modify option
fi: Asiakas voi muuttaa vaihtoehtoa

source: Copy URL
fi: Kopioi URL-osoite

source: Share
fi: Jaa

source: Refund
fi: Hyvitä

source: Give refund upon cancellation?
fi: Annetaanko palautus peruutuksen yhteydessä?

source: Refund Type
fi: Hyvityksen tyyppi

source: Full refund
fi: Täysi palautus

source: Partial refund
fi: Osittainen palautus

source: Refund Reason
fi: Hyvityksen syy

source: Forms
fi: Lomakkeet

source: More
fi: Lisää

source: Sorry, you are not allowed to access this page
fi: Pahoittelut, sinulla ei ole pääsyä tälle sivulle

source: Welcome,
fi: Tervetuloa,

source: Dashboard
fi: Ohjausnäkymä

source: Swtich to WordPress
fi: Vaihda WordPressiin

source: Upcoming
fi: Tulossa

source: Date:
fi: Päivämäärä:

source: Duration:
fi: Kesto:

source: Full Name:
fi: Koko nimi:

source: Email:
fi: Sähköposti:

source: Compact Mode
fi: Kompakti tila

source: Approve
fi: Hyväksy

source: Title
fi: Otsikko

source: Coupon Code
fi: Kuponkikoodi

source: Discount
fi: Alennus

source: Coupon Duration
fi: Kupongin kesto

source: Never Expires
fi: Ei vanhene koskaan

source: All Services
fi: Kaikki palvelut

source: Allowed Uses
fi: Sallitut käytöt

source: Usages
fi: Käytöt

source: Are you sure you want to delete this coupon?
fi: Haluatko varmasti poistaa tämän kupongin?

source: Add Coupon
fi: Lisää kuponki

source: Edit Coupon
fi: Muokkaa kuponkia

source: Coupon Period Type
fi: Kuponkijakson tyyppi

source: Date Range
fi: Aikaväli

source: Enter coupon title
fi: Syötä kupongin otsikko

source: Start Date
fi: Aloituspäivä

source: Select Start Date
fi: Valitse aloituspäivä

source: End Date
fi: Päättymispäivä

source: Select End Date
fi: Valitse päättymispäivä

source: Enter Coupon Code
fi: Syötä alennuskoodi

source: Generate
fi: Luo

source: Enter discount
fi: Syötä alennus

source: Select Services
fi: Valitse palvelut

source: No. of times uses allowed
fi: Sallittujen käyttökertojen määrä

source: Manage Customers
fi: Hallitse asiakkaita

source: Search customer
fi: Hae asiakasta

source: Full Name
fi: Koko nimi

source: Recent Appointment
fi: Viimeisin varaus

source: Are you sure you want to delete this customer?
fi: Haluatko varmasti poistaa tämän asiakkaan?

source: Recent Appointment:
fi: Viimeisin varaus:

source: Total Appointments:
fi: Varauksia yhteensä:

source: Save Changes
fi: Tallenna muutokset

source: Booking Form
fi: Varauslomake

source: Font:
fi: Fontti:

source: Main color:
fi: Pääväri:

source: Primary color
fi: Ensisijainen väri

source: Form background color
fi: Lomakkeen taustaväri

source: Panel background color
fi: Paneelin taustaväri

source: Border color
fi: Reunojen väri

source: Form color:
fi: Lomakkeen väri:

source: Title color
fi: Otsikon väri

source: Sub title color
fi: Aliotsikon väri

source: Content color
fi: Sisällön väri

source: Price & Button text:
fi: Hinta & painikkeen teksti:

source: Actions:
fi: Toimet:

source: Yes
fi: Kyllä

source: Are you sure you want to reset the settings?
fi: Haluatko varmasti nollata asetukset?

source: Booking form sequence
fi: Varauslomakkeen järjestys

source: Service Selection
fi: Palvelun valinta

source: Booking Wizard Tabs Position
fi: Varauslomakkeen välilehden sijainti

source: Left
fi: Vasemmalla

source: Top
fi: Ylhäällä

source: Hide service selection step
fi: Piilota palvelun valintavaihe

source: Category & Service step can be hide only when it is set to the first step
fi: Kategoria- ja palveluvaihe voidaan piilottaa vain, jos se on asetettu ensimmäiseksi vaiheeksi

source: Select "All" as default category
fi: Valitse "Kaikki" oletusluokaksi

source: Hide service description
fi: Piilota palvelun kuvaus

source: Hide service duration
fi: Piilota palvelun kesto

source: Hide service price
fi: Piilota palvelun hinta

source: Enable google recaptcha
fi: Ota google recaptcha käyttöön

source: Hide booked time slots
fi: Piilota varatut ajat

source: Hide time slot grouping
fi: Piilota aikavälien ryhmittely

source: Hide Capacity Information
fi: Piilota kapasiteettitiedot

source: Inherit From Wordpress
fi: Peri Wordpressistä

source: Hide
fi: Piilota

source: selection
fi: valinta

source: Information
fi: Tiedot

source: Show both phone number and emaill address
fi: Näytä sekä puhelinnumero että sähköpostiosoite

source: Show only email address
fi: Näytä vain sähköpostiosoite

source: Show only phone number
fi: Näytä vain puhelinnumero

source: Don't show both phone number and emaill address
fi: Älä näytä puhelinnumeroa äläkä sähköpostiosoitetta

source: In-built
fi: Sisäänrakennettu

source: Upon success
fi: Onnistumisen jälkeen

source: Upon failure
fi: Virheen sattuessa

source: Thank you message
fi: Kiitosviesti

source: Failed Payment
fi: Epäonnistunut maksu

source: Sample category 1
fi: Näyteluokka 1

source: Sample category 2
fi: Näyteluokka 2

source: Sample category 3
fi: Näyteluokka 3

source: Sample service 1
fi: Esimerkkipalvelu 1

source: Sample service 2
fi: Esimerkkipalvelu 2

source: Sample service 3
fi: Esimerkkipalvelu 3

source: Sample service 4
fi: Esimerkkipalvelu 4

source: Mon
fi: Ma

source: Tue
fi: Ti

source: Wed
fi: Ke

source: Thu
fi: To

source: Fri
fi: Pe

source: Sat
fi: La

source: Sun
fi: Su

source: Please enter your name
fi: Anna nimesi

source: Please enter your email
fi: Anna sähköpostiosoitteesi

source: Please enter your note
fi: Kirjoita muistiinpanosi

source: I agree with
fi: Hyväksyn

source: terms & conditions
fi: ehdot & säännöt

source: Label Settings
fi: Etiketin asetukset

source: Common field labels
fi: Yleiset kentän merkinnät

source: Go back button
fi: Palaa takaisin-painike

source: Next button
fi: Seuraava painike

source: Book appointment button
fi: Varaa tapaaminen -painike

source: Day label
fi: Päivän etiketti

source: Step service
fi: Vaiheen palvelu

source: Category title
fi: Kategorian otsikko

source: All category
fi: Kaikki luokka

source: Service title
fi: Palvelun otsikko

source: Service duration
fi: Palvelun kesto

source: Service price
fi: Palvelun hinta

source: Continue button
fi: Jatka-painike

source: Cancel button
fi: Peruuta-painike

source: Time slot title
fi: Aikaväli otsikko

source: Afternoon time slot title
fi: Iltapäivän aikavälin otsikko

source: Date & time step note
fi: Päiväys ja kellonaika askelmerkintä

source: Remaining slots title
fi: Jäljellä olevien aikojen Otsikko

source: Basic details step labels
fi: Perustiedot askeleiden merkinnät

source: Summary step note
fi: Yhteenvedon askelmerkintä

source: Total amount title
fi: Kokonaismäärän otsikko

source: Subtotal title
fi: Välisumman otsikko

source: Card details title
fi: Kortin tiedot otsikko

source: Card name placeholder
fi: Kortin nimen haltija

source: Cvv placeholder
fi: CVV-leipäteksti

source: Make Payment button title
fi: Tee maksu -painikkeen otsikko

source: Content Settings
fi: Sisällön asetukset

source: Customer Options
fi: Asiakkaan vaihtoehdot

source: Allow cancel appointment
fi: Salli peruuttaa tapaaminen

source: Appointment cancellation confirmation
fi: Vahvistus tapaamisen peruutuksesta

source: Cancelled appointment redirection
fi: Peruutetun tapaamisen uudelleenohjaus

source: Allow reschedule appointment
fi: Salli tapaamisen siirtäminen

source: Appointment reschedule Page
fi: Ajanvarauksen siirtäminen Sivu

source: Allow repeat booking
fi: Salli toistuva varaus

source: Allow edit profile
fi: Salli muokata profiilia

source: Delete account content
fi: Poista tilin tiedot

source: My booking title
fi: Minun varaukseni otsikko

source: Apply button
fi: Käytä painike

source: Logout title
fi: Uloskirjautumisen otsikko

source: Delete account title
fi: Poista tilin otsikko

source: Delete account description
fi: Poista tilin kuvaus

source: Delete account button label
fi: Poista tili -painikkeen etiketti

source: ID title
fi: ID:n otsikko

source: Date title
fi: Päivämäärän otsikko

source: Status title
fi: Tilan otsikko

source: staff title
fi: henkilöstön nimike

source: Payment title
fi: Maksun otsikko

source: No. Of Person title
fi: Henkilöiden lukumäärä (Otsikko)

source: Tax title
fi: Verotusnimike

source: Coupon title
fi: Kupongin otsikko

source: Payment details title
fi: Maksutietojen otsikko

source: Download invoice button label
fi: Lataa laskun painikkeen etiketti

source: Login Related Messages
fi: Kirjautumiseen liittyvät viestit

source: Login form title
fi: Kirjautumislomakkeen otsikko

source: Username / Email field label
fi: Käyttäjätunnus / sähköpostiosoite kentän etiketti

source: Username / Email field Placeholder
fi: Käyttäjätunnus / Sähköposti-kentän leipäteksti

source: Password label
fi: Salasanan etiketti

source: User name required field label
fi: Käyttäjän nimi pakollisen kentän etiketti

source: Login button label
fi: Kirjautumispainikkeen etiketti

source: Edit Account Messages
fi: Muokkaa tilin viestejä

source: Update Profile Button Label
fi: Päivitä profiilin painikkeen etiketti

source: Update Profile Success Message
fi: Profiilin päivityksen onnistumisviesti

source: Update password button label
fi: Päivitä salasanan painikkeen etiketti

source: Update password success message
fi: Salasanan päivityksen onnistumisviesti

source: Update password error message
fi: Päivitä salasana virheilmoitus

source: Reschedule title
fi: Uudelleen aikatauluttaminen otsikko

source: Popup title
fi: Ponnahdusikkunan otsikko

source: Popup description
fi: Ponnahdusikkunan kuvaus

source: Date label
fi: Päivämäärämerkintä

source: Time label
fi: Aikamerkintä

source: Cancel button label
fi: Peruuta-painikkeen etiketti

source: Update button label
fi: Päivitä painikkeen etiketti

source: Reschedule appointment success message
fi: Ajanvarauksen uudelleenjärjestämisen onnistumisviesti

source: Cancel appointment title
fi: Peruuta tapaaminen otsikko

source: Confirmation message
fi: Vahvistusviesti

source: No button text
fi: Ei-painikkeen teksti

source: Yes button text
fi: Kyllä-painikkeen teksti

source: Cancel Appointment Confirmation Messages
fi: Peruuta Ajanvaraus vahvistusviestit

source: Booking ID label
fi: Varaustunnuksen etiketti

source: Service label
fi: Palvelumerkintä

source: Date & Time label
fi: Päivämäärän ja kellonajan merkintä

source: Paid amount label
fi: Maksetun määrän merkintä

source: Refund amount label
fi: Palautuksen määrän merkintä

source: Confirm cancellation button text
fi: Vahvista peruutus -painikkeen teksti

source: Apply button text (my booking)
fi: Käytä painikkeen teksti (varaukseni)

source: Custom CSS
fi: Mukautettu CSS

source: close
fi: sulje

source: Thank You Message
fi: Kiitosviesti

source: Failed Payment Message
fi: Epäonnistunut maksuviesti

source: Form
fi: Osoitteesta

source: Form Elements
fi: Lomake-elementit

source: Text Field
fi: Tekstikenttä

source: Textarea
fi: Tekstialue

source: Checkbox
fi: Valintaruutu

source: Radio
fi: Valintapainike

source: Dropdown
fi: Pudotusvalikko

source: DatePicker
fi: Päivämäärän valitsin

source: File Upload
fi: Tiedoston lataus

source: Repeater
fi: Toistin

source: Columns
fi: Sarakkeet

source: 2 Columns
fi: 2 saraketta

source: 3 Columns
fi: 3 saraketta

source: 4 Columns
fi: 4 saraketta

source: Field Settings
fi: Kentän asetukset

source: Label
fi: Tunniste

source: Field Options
fi: Kentän vaihtoehdot

source: Manage Options
fi: Hallitse vaihtoehtoja

source: Preset Values
fi: Esiasetetut arvot

source: Select Preset Values
fi: Valitse esiasetetut arvot

source: Use Separate Value
fi: Käytä erillistä arvoa

source: Set Custom Placeholder
fi: Aseta mukautettu leipäteksti

source: Error Message
fi: Virheviesti

source: Meta Key
fi: Meta-avain

source: Enable Time Picker
fi: Ota ajan-valinta käyttöön

source: File Size Limit
fi: Tiedoston kokorajoitus

source: PHP Maximum Upload Size
fi: PHP:n enimmäislatauskoko

source: Allowed File Extension
fi: Sallittu tiedostotunniste

source: You should place comma separated list of file extensions.
fi: Sinun pitäisi laittaa pilkulla erotettu luettelo tiedostopäätteistä.

source: Leave blank for allow all file types.
fi: Jätä tyhjäksi, jos haluat sallia kaikki tiedostotyypit.

source: Invalid Field message
fi: Invalid Field -viesti

source: Attach file with email
fi: Liitä tiedosto sähköpostiin

source: Visibility
fi: Näkyvyys

source: Always
fi: Aina

source: Show conditionally on specific service
fi: Näytä ehdollisesti tietystä palvelusta

source: Please select at-least one service
fi: Valitse vähintään yksi palvelu

source: Hidden
fi: Piilotettu

source: CSS Class
fi: CSS-luokka
